docs/faith-and-judgement.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

* My thoughts and bible references regarding theology
*Acts 13:48* - And when the Gentiles heard this, they began rejoicing and glorifying the word of the Lord, and as many as were appointed to eternal life believed. (ESV)

I've been thinking about belief, faith, works, law and receiving the Holy Spirit!
Please let me know what you think if you have the time.

I'm trying to get clearer on this.
Please feel free to discuss it with me.

I haven't finished this but it's good:

https://www.youtube.com/watch?v=CNHKqhwu6Bo&ab_channel=CornerFringeMinistries

* laws
- Great commandments
  - to love the Lord your God with all your heart, soul, mind and strength and your neighbour as yourself
- 10 Commandments
- the 613 Mosaic laws
- the law of Christ

* Commandments and faith
*Revelation of John 14:12* - Here is a call for the endurance of the saints, those who keep the commandments of God and their faith in Jesus.

I read this as 'A saint is someone who has faith in Jesus AND keeps the commandments (pursuing by faith, not works)'.
I read this as the Great commandments, 10 Commandments and faith in Jesus Christ, and potentially various other commandments from the Mosaic law if you now about them, or whatever subset a person practices.
But the law should be pursued by faith and not by works.

*John 15:10* - If you keep my commandments, you will abide in my love, just as I have kept my Father's commandments and abide in his love.

*Romans 9:30-32* - What shall we say, then? That Gentiles who did not pursue righteousness have attained it, that is, a righteousness that is by faith; but that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone, (ESV)

Jesus' commandments don't contradict the rest of the commandments.

Also God's commandments (especially the 10 Commandments; loving God and your neighbour) are still binding on us - written on our heart when we get born-again.

*Deuteronomy 4:13* - And he declared to you his covenant, which he commanded you to perform, that is, the Ten Commandments, and he wrote them on two tablets of stone.

*Romans 10:5* - For Moses writes about the righteousness that is based on the law, that the person who does the commandments shall live by them.

*Romans 13:9* - The commandments, You shall not commit adultery, You shall not murder, You shall not steal, You shall not covet, and any other commandment, are summed up in this word: You shall love your neighbor as yourself.

There's no contradiction.

However, we must submit to God's righteousness through faith in Jesus Christ.

The Mosaic law is not abolished but Jesus fulfilled it like a prophesy.

The righteousness we have through faith in Jesus Christ is needed whether someone keeps the Mosaic law or not.
Not that I keep the Mosaic law in its entirety, nor are circumcised. But I try to keep the Great commandments
and the 10 Commandments out of faith (and a relationship with God) and follow parts of the Mosaic law,
but I have faith in Jesus Christ for the righteousness that comes through faith because I need that because my own
righteousness will never be enough without faith in Jesus for God's righteousness imputed to me.

Thank You God.

*Ephesians 2:8* -  For by grace you have been saved through faith.  And this is not your own doing; it is the gift of God,  (ESV)

AMEN!!

*Galatians 2:17* -- But if, in our endeavor to be justified in Christ, we too were found to be sinners, is Christ then a servant of sin? Certainly not! (ESV)

AMEN!!

*Romans 10:3-4* - For, being ignorant of the righteousness that comes from God, and seeking to establish their own, they did not submit to God's righteousness. For Christ is the end of the law for righteousness to everyone who believes.

This is why we are not *under* the law because we have the righteousness that comes through faith in Christ.

But we are under the law of faith in Christ.
And we are supposed to keep the commandments by pursuing them in faith.

* Jesus fulfilled the law
- Who gave Moses the law and the instructions to build the tabernacle? God did.
  - The blueprints came from God.
- The Law, the Psalms and the Prophets all point to Jesus.
- Moses wrote about Jesus.
- Jesus fulfilled the Law and the prophesies.

We still follow the law but by faith and not by works.

We keep accountability with God, and in truth over following the law - God knows when we lie, cheat, commit adultery, idolise etc.
We follow the law in truth.
Jesus fulfilled the law. Jesus' blood is the atonement for sin.
So we go to Jesus for forgiveness instead of perform the ceremonial law to try to make atonement for sin.

This looks like an interesting resource about that - http://www.abideinchrist.com/messages/tabernacletype.html

