docs/faith-and-judgement.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-07 Wed 13:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-orgc9c6347" class="outline-2">
<h2 id="orgc9c6347"><span class="section-number-2">1.</span> My thoughts and bible references regarding theology</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Acts 13:48</b> - And when the Gentiles heard this, they began rejoicing and glorifying the word of the Lord, and as many as were appointed to eternal life believed. (ESV)
</p>

<p>
I've been thinking about belief, faith, works, law and receiving the Holy Spirit!
Please let me know what you think if you have the time.
</p>

<p>
I'm trying to get clearer on this.
Please feel free to discuss it with me.
</p>

<p>
I haven't finished this but it's good:
</p>

<p>
<a href="https://www.youtube.com/watch?v=CNHKqhwu6Bo&amp;ab_channel=CornerFringeMinistries">https://www.youtube.com/watch?v=CNHKqhwu6Bo&amp;ab_channel=CornerFringeMinistries</a>
</p>
</div>
</div>

<div id="outline-container-orgf3eda1a" class="outline-2">
<h2 id="orgf3eda1a"><span class="section-number-2">2.</span> laws</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Great commandments
<ul class="org-ul">
<li>to love the Lord your God with all your heart, soul, mind and strength and your neighbour as yourself</li>
</ul></li>
<li>10 Commandments</li>
<li>the 613 Mosaic laws</li>
<li>the law of Christ</li>
</ul>
</div>
</div>

<div id="outline-container-orge5742e3" class="outline-2">
<h2 id="orge5742e3"><span class="section-number-2">3.</span> Commandments and faith</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Revelation of John 14:12</b> - Here is a call for the endurance of the saints, those who keep the commandments of God and their faith in Jesus.
</p>

<p>
I read this as 'A saint is someone who has faith in Jesus AND keeps the commandments (pursuing by faith, not works)'.
I read this as the Great commandments, 10 Commandments and faith in Jesus Christ, and potentially various other commandments from the Mosaic law if you now about them, or whatever subset a person practices.
But the law should be pursued by faith and not by works.
</p>

<p>
<b>John 15:10</b> - If you keep my commandments, you will abide in my love, just as I have kept my Father's commandments and abide in his love.
</p>

<p>
<b>Romans 9:30-32</b> - What shall we say, then? That Gentiles who did not pursue righteousness have attained it, that is, a righteousness that is by faith; but that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone, (ESV)
</p>

<p>
Jesus' commandments don't contradict the rest of the commandments.
</p>

<p>
Also God's commandments (especially the 10 Commandments; loving God and your neighbour) are still binding on us - written on our heart when we get born-again.
</p>

<p>
<b>Deuteronomy 4:13</b> - And he declared to you his covenant, which he commanded you to perform, that is, the Ten Commandments, and he wrote them on two tablets of stone.
</p>

<p>
<b>Romans 10:5</b> - For Moses writes about the righteousness that is based on the law, that the person who does the commandments shall live by them.
</p>

<p>
<b>Romans 13:9</b> - The commandments, You shall not commit adultery, You shall not murder, You shall not steal, You shall not covet, and any other commandment, are summed up in this word: You shall love your neighbor as yourself.
</p>

<p>
There's no contradiction.
</p>

<p>
However, we must submit to God's righteousness through faith in Jesus Christ.
</p>

<p>
The Mosaic law is not abolished but Jesus fulfilled it like a prophesy.
</p>

<p>
The righteousness we have through faith in Jesus Christ is needed whether someone keeps the Mosaic law or not.
Not that I keep the Mosaic law, nor are circumcised.
</p>

<p>
<b>Romans 10:3-4</b> - For, being ignorant of the righteousness that comes from God, and seeking to establish their own, they did not submit to God's righteousness. For Christ is the end of the law for righteousness to everyone who believes.
</p>

<p>
This is why we are not <b>under</b> the law because we have the righteousness that comes through faith in Christ.
</p>

<p>
But we are under the law of faith in Christ.
And we are supposed to keep the commandments by pursuing them in faith.
</p>
</div>
</div>

<div id="outline-container-org41bdf4c" class="outline-2">
<h2 id="org41bdf4c"><span class="section-number-2">4.</span> Jesus fulfilled the law</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Who gave Moses the law and the instructions to build the tabernacle? God did.
<ul class="org-ul">
<li>The blueprints came from God.</li>
</ul></li>
<li>The Law, the Psalms and the Prophets all point to Jesus.</li>
<li>Moses wrote about Jesus.</li>
<li>Jesus fulfilled the Law and the prophesies.</li>
</ul>

<p>
We still follow the law but by faith and not by works.
</p>

<p>
We keep accountability with God, and in truth over following the law - God knows when we lie, cheat, commit adultery, idolise etc.
We follow the law in truth.
Jesus fulfilled the law. Jesus' blood is the atonement for sin.
So we go to Jesus for forgiveness instead of perform the ceremonial law to try to make atonement for sin.
</p>

<p>
This looks like an interesting resource about that - <a href="http://www.abideinchrist.com/messages/tabernacletype.html">http://www.abideinchrist.com/messages/tabernacletype.html</a>
</p>
</div>
