docs/faith-and-judgement.tex
% Created 2024-02-07 Wed 13:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\author{root}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={root},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1.50 (Org mode 9.6.8)}, 
 pdflang={English}}
\begin{document}


\section{My thoughts and bible references regarding theology}
\label{sec:orgf16b493}
\textbf{Acts 13:48} - And when the Gentiles heard this, they began rejoicing and glorifying the word of the Lord, and as many as were appointed to eternal life believed. (ESV)

I've been thinking about belief, faith, works, law and receiving the Holy Spirit!
Please let me know what you think if you have the time.

I'm trying to get clearer on this.
Please feel free to discuss it with me.

I haven't finished this but it's good:

\url{https://www.youtube.com/watch?v=CNHKqhwu6Bo\&ab\_channel=CornerFringeMinistries}

\section{Commandments and faith}
\label{sec:orgd0e8252}
I read this as 'A saint is someone who has faith in Jesus and keeps the commandments (pursuing by faith, not works)'.

\textbf{Revelation of John 14:12} - Here is a call for the endurance of the saints, those who keep the commandments of God and their faith in Jesus.

\textbf{John 15:10} - If you keep my commandments, you will abide in my love, just as I have kept my Father's commandments and abide in his love.

\textbf{Romans 9:30-32} - What shall we say, then? That Gentiles who did not pursue righteousness have attained it, that is, a righteousness that is by faith; but that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone, (ESV)

Jesus' commandments don't contradict the rest of the commandments.

Also God's commandments (especially the 10 Commandments; loving God and your neighbour) are still binding on us - written on our heart when we get born-again.

\textbf{Deuteronomy 4:13} - And he declared to you his covenant, which he commanded you to perform, that is, the Ten Commandments, and he wrote them on two tablets of stone.

\textbf{Romans 10:5} - For Moses writes about the righteousness that is based on the law, that the person who does the commandments shall live by them.

\textbf{Romans 13:9} - The commandments, You shall not commit adultery, You shall not murder, You shall not steal, You shall not covet, and any other commandment, are summed up in this word: You shall love your neighbor as yourself.

There's no contradiction.

However, we must submit to God's righteousness through faith in Jesus Christ.
The law is not abolished but Jesus fulfilled it like a prophesy.
The righteousness we have through faith in Jesus Christ is needed whether we keep the law or not.

\textbf{Romans 10:3-4} - For, being ignorant of the righteousness that comes from God, and seeking to establish their own, they did not submit to God's righteousness. For Christ is the end of the law for righteousness to everyone who believes.

\section{Jesus fulfilled the law}
\label{sec:org03059f6}
\begin{itemize}
\item Who gave Moses the law and the instructions to build the tabernacle? God did.
\begin{itemize}
\item The blueprints came from God.
\end{itemize}
\item The Law, the Psalms and the Prophets all point to Jesus.
\item Moses wrote about Jesus.
\item Jesus fulfilled the Law and the prophesies.
\end{itemize}

We still follow the law but by faith and not by works.

We keep accountability with God, and in truth over following the law - God knows when we lie, cheat, commit adultery, idolise etc.
We follow the law in truth.
Jesus fulfilled the law. Jesus' blood is the atonement for sin.
So we go to Jesus for forgiveness instead of perform the ceremonial law to try to make atonement for sin.

This looks like an interesting resource about that - \url{http://www.abideinchrist.com/messages/tabernacletype.html}
