docs/faith-and-judgement.org
** We are certainly supposed to keep the commandments - but not for justification

*Matthew 19:17-21* - And he said to him, Why do you ask me about what is good? There is only one who is good. If you would enter life, keep the commandments.  He said to him, Which ones? And Jesus said, You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and mother, and, You shall love your neighbor as yourself.  The young man said to him, All these I have kept. What do I still lack?  Jesus said to him, If you would be perfect, go, sell what you possess and give to the poor, and you will have treasure in heaven; and come, follow me.

*Romans 13:9* - The commandments, You shall not commit adultery, You shall not murder, You shall not steal, You shall not covet, and any other commandment, are summed up in this word: You shall love your neighbor as yourself.

*Galatians 5:14* - For the whole law is fulfilled in one word: You shall love your neighbor as yourself.

*James 2:8-13* - If you really fulfill the royal law according to the Scripture, You shall love your neighbor as yourself, you are doing well.  But if you show partiality, you are committing sin and are convicted by the law as transgressors.  For whoever keeps the whole law but fails in one point has become accountable for all of it.  For he who said, Do not commit adultery, also said, Do not murder. If you do not commit adultery but do murder, you have become a transgressor of the law.  So speak and so act as those who are to be judged under the law of liberty.  For judgment is without mercy to one who has shown no mercy. Mercy triumphs over judgment.

*Romans 2:13* - For it is not the hearers of the law who are righteous before God, but the doers of the law who will be justified. (ESV)

*Romans 3:31* - Do we then overthrow the law by this faith? By no means! On the contrary, we uphold the law. (ESV)

*** But we must submit to the righteousness from God through faith in Jesus - this is more important
*Romans 10:3-5* - For, being ignorant of the righteousness that comes from God, and seeking to establish their own, they did not submit to God's righteousness.  For Christ is the end of the law for righteousness to everyone who believes.  For Moses writes about the righteousness that is based on the law, that the person who does the commandments shall live by them.

*** The honour is for those who believe
Have faith in Jesus and do good.

I Peter 2:6-25: For it stands in Scripture: Behold, I am laying in Zion a stone, a cornerstone chosen and precious, and whoever believes in him will not be put to shame.  So the honor is for you who believe, but for those who do not believe, The stone that the builders rejected has become the cornerstone, and A stone of stumbling, and a rock of offense. They stumble because they disobey the word, as they were destined to do.  But you are a chosen race, a royal priesthood, a holy nation, a people for his own possession, that you may proclaim the excellencies of him who called you out of darkness into his marvelous light.  Once you were not a people, but now you are God's people; once you had not received mercy, but now you have received mercy.  Beloved, I urge you as sojourners and exiles to abstain from the passions of the flesh, which wage war against your soul.  Keep your conduct among the Gentiles honorable, so that when they speak against you as evildoers, they may see your good deeds and glorify God on the day of visitation.  Be subject for the Lord's sake to every human institution, whether it be to the emperor as supreme, or to governors as sent by him to punish those who do evil and to praise those who do good.  For this is the will of God, that by doing good you should put to silence the ignorance of foolish people.  Live as people who are free, not using your freedom as a cover-up for evil, but living as servants of God.  Honor everyone. Love the brotherhood. Fear God. Honor the emperor.  Servants, be subject to your masters with all respect, not only to the good and gentle but also to the unjust.  For this is a gracious thing, when, mindful of God, one endures sorrows while suffering unjustly.  For what credit is it if, when you sin and are beaten for it, you endure? But if when you do good and suffer for it you endure, this is a gracious thing in the sight of God.  For to this you have been called, because Christ also suffered for you, leaving you an example, so that you might follow in his steps.  He committed no sin, neither was deceit found in his mouth.  When he was reviled, he did not revile in return; when he suffered, he did not threaten, but continued entrusting himself to him who judges justly.  He himself bore our sins in his body on the tree, that we might die to sin and live to righteousness. By his wounds you have been healed.  For you were straying like sheep, but have now returned to the Shepherd and Overseer of your souls.

* Faith
One must have faith to receive the gift of salvation.

