docs/faith-and-judgement.html

<div id="outline-container-org3a4a02d" class="outline-3">
<h3 id="org3a4a02d"><span class="section-number-3">5.1.</span> The faith itself may be a gift, but certainly is cooperative</h3>
<div class="outline-text-3" id="text-5-1">
<p>
God spoke to Abraham first, and then Abraham believed God.
</p>

<p>
But God made the first move.
The first move from Abraham was belief.
</p>

<p>
The Lord God spoke first - this itself is a gift.
</p>

<p>
Faith involves:
</p>
<ul class="org-ul">
<li>Obedience</li>
<li>Loyalty (faithfulness to God)</li>
<li>God rewarded Abram with a promise</li>
<li>Abram believed God</li>
<li>God counted Abram's belief as righteousness</li>
</ul>

<p>
<b>Genesis 12:1</b> - Now the Lord said to Abram, Go from your country and your kindred and your father's house to the land that I will show you.
</p>

<p>
Abraham <b>obeyed</b> God.
</p>

<p>
<b>Genesis 12:4</b> - So Abram went, as the Lord had told him, and Lot went with him. Abram was seventy-five years old when he departed from Haran.
</p>

<p>
God promised him something, and gave Abram an instruction.
</p>

<p>
<b>Genesis 13:14</b> - The Lord said to Abram, after Lot had separated from him, Lift up your eyes and look from the place where you are, northward and southward and eastward and westward, for all the land that you see I will give to you and to your offspring forever.  I will make your offspring as the dust of the earth, so that if one can count the dust of the earth, your offspring also can be counted. Arise, walk through the length and the breadth of the land, for I will give it to you.
</p>

<p>
Abram obeyed.
</p>

<p>
<b>Genesis 13:18</b> - So Abram moved his tent and came and settled by the oaks of Mamre, which are at Hebron, and there he built an altar to the Lord.
</p>

<p>
Abram interacted with Melchizedek, priest of God Most High, blessed by God Most High.
</p>

<p>
<b>Genesis 14:18-20</b> - And Melchizedek king of Salem brought out bread and wine. (He was priest of God Most High. ) And he blessed him and said, Blessed be Abram by God Most High, Possessor of heaven and earth; and blessed be God Most High, who has delivered your enemies into your hand! And Abram gave him a tenth of everything.
</p>

<p>
Abram, in an act of faith with faithfulness, displayed loyalty to God.
</p>

<p>
<b>Genesis 14:21-24</b> - And the king of Sodom said to Abram, Give me the persons, but take the goods for yourself.  But Abram said to the king of Sodom, I have lifted my hand to the Lord, God Most High, Possessor of heaven and earth, that I would not take a thread or a sandal strap or anything that is yours, lest you should say, I have made Abram rich.  I will take nothing but what the young men have eaten, and the share of the men who went with me. Let Aner, Eshcol, and Mamre take their share.
</p>

<p>
God noticed and gave Abram a vision and made a promise to Abram, and Abram believed God and God counted it to Abram as righteousness.
</p>

<p>
<b>Genesis 15:1</b> - After these things the word of the Lord came to Abram in a vision: Fear not, Abram, I am your shield; your reward shall be very great.  But Abram said, O Lord God, what will you give me, for I continue childless, and the heir of my house is Eliezer of Damascus?  And Abram said, Behold, you have given me no offspring, and a member of my household will be my heir.  And behold, the word of the Lord came to him: This man shall not be your heir; your very own son shall be your heir.  And he brought him outside and said, Look toward heaven, and number the stars, if you are able to number them. Then he said to him, So shall your offspring be.  And he believed the Lord, and he counted it to him as righteousness.
</p>
</div>
