docs/faith-and-judgement.tex

\subsection{The faith itself may be a gift, but certainly is cooperative}
\label{sec:org3890739}
God spoke to Abraham first, and then Abraham believed God.

But God made the first move.
The first move from Abraham was belief.

The Lord God spoke first - this itself is a gift.

Faith involves:
\begin{itemize}
\item Obedience
\item Loyalty (faithfulness to God)
\item God rewarded Abram with a promise
\item Abram believed God
\item God counted Abram's belief as righteousness
\end{itemize}

\textbf{Genesis 12:1} - Now the Lord said to Abram, Go from your country and your kindred and your father's house to the land that I will show you.

Abraham \textbf{obeyed} God.

\textbf{Genesis 12:4} - So Abram went, as the Lord had told him, and Lot went with him. Abram was seventy-five years old when he departed from Haran.

God promised him something, and gave Abram an instruction.

\textbf{Genesis 13:14} - The Lord said to Abram, after Lot had separated from him, Lift up your eyes and look from the place where you are, northward and southward and eastward and westward, for all the land that you see I will give to you and to your offspring forever.  I will make your offspring as the dust of the earth, so that if one can count the dust of the earth, your offspring also can be counted. Arise, walk through the length and the breadth of the land, for I will give it to you.

Abram obeyed.

\textbf{Genesis 13:18} - So Abram moved his tent and came and settled by the oaks of Mamre, which are at Hebron, and there he built an altar to the Lord.

Abram interacted with Melchizedek, priest of God Most High, blessed by God Most High.

\textbf{Genesis 14:18-20} - And Melchizedek king of Salem brought out bread and wine. (He was priest of God Most High. ) And he blessed him and said, Blessed be Abram by God Most High, Possessor of heaven and earth; and blessed be God Most High, who has delivered your enemies into your hand! And Abram gave him a tenth of everything.

Abram, in an act of faith with faithfulness, displayed loyalty to God.

\textbf{Genesis 14:21-24} - And the king of Sodom said to Abram, Give me the persons, but take the goods for yourself.  But Abram said to the king of Sodom, I have lifted my hand to the Lord, God Most High, Possessor of heaven and earth, that I would not take a thread or a sandal strap or anything that is yours, lest you should say, I have made Abram rich.  I will take nothing but what the young men have eaten, and the share of the men who went with me. Let Aner, Eshcol, and Mamre take their share.

God noticed and gave Abram a vision and made a promise to Abram, and Abram believed God and God counted it to Abram as righteousness.

\textbf{Genesis 15:1} - After these things the word of the Lord came to Abram in a vision: Fear not, Abram, I am your shield; your reward shall be very great.  But Abram said, O Lord God, what will you give me, for I continue childless, and the heir of my house is Eliezer of Damascus?  And Abram said, Behold, you have given me no offspring, and a member of my household will be my heir.  And behold, the word of the Lord came to him: This man shall not be your heir; your very own son shall be your heir.  And he brought him outside and said, Look toward heaven, and number the stars, if you are able to number them. Then he said to him, So shall your offspring be.  And he believed the Lord, and he counted it to him as righteousness.
