docs/faith-and-judgement.org
*** The faith of Abraham looks like this. This is what salvation-accepting faith looks like

/*Obeying God.*/

*Hebrews 11:8* - By faith Abraham obeyed when he was called to go out to a place that he was to receive as an inheritance. And he went out, not knowing where he was going.

*Genesis 12:1-3* - Now the LORD said to Abram, Go from your country and your kindred and your father's house to the land that I will show you. And I will make of you a great nation, and I will bless you and make your name great, so that you will be a blessing. I will bless those who bless you, and him who dishonors you I will curse, and in you all the families of the earth shall be blessed. (ESV)

/*Believing God.*/

*Genesis 15:1* - After these things the word of the Lord came to Abram in a vision: Fear not, Abram, I am your shield; your reward shall be very great.  But Abram said, O Lord God, what will you give me, for I continue childless, and the heir of my house is Eliezer of Damascus?  And Abram said, Behold, you have given me no offspring, and a member of my household will be my heir.  And behold, the word of the Lord came to him: This man shall not be your heir; your very own son shall be your heir.  And he brought him outside and said, Look toward heaven, and number the stars, if you are able to number them. Then he said to him, So shall your offspring be.  And he believed the Lord, and he counted it to him as righteousness.

/*Conviction.*/

*Hebrews 11:17-19* - By faith Abraham, when he was tested, offered up Isaac, and he who had received the promises was in the act of offering up his only son, of whom it was said, Through Isaac shall your offspring be named. He considered that God was able even to raise him from the dead, from which, figuratively speaking, he did receive him back.

Like Abraham, a believer's faith may be tested.

/*Trust in God.*/,

/*Fear of God.*/,

/*Testable faith.*/

*Genesis 22:9-14* - When they came to the place of which God had told him, Abraham built the altar there and laid the wood in order and bound Isaac his son and laid him on the altar, on top of the wood.  Then Abraham reached out his hand and took the knife to slaughter his son.  But the angel of the Lord called to him from heaven and said, Abraham, Abraham! And he said, Here am I.  He said, Do not lay your hand on the boy or do anything to him, for now I know that you fear God, seeing you have not withheld your son, your only son, from me.  And Abraham lifted up his eyes and looked, and behold, behind him was a ram, caught in a thicket by his horns. And Abraham went and took the ram and offered it up as a burnt offering instead of his son.  So Abraham called the name of that place, The Lord will provide; as it is said to this day, On the mount of the Lord it shall be provided.

/*Holding onto the promise, even to death if required.*/

*Hebrews 11:13* - These all died in faith, not having received the things promised, but having seen them and greeted them from afar, and having acknowledged that they were strangers and exiles on the earth.

Like Abraham, a believer keeps the faith right to the end of their life or until Jesus takes them home.

/*Patient endurance / waiting on God (belief * time).*/

We should have *busy* (non-sluggish) faith,
and imitate the faith of people such as
Abraham, so that we inherit the promises.
We can believe those promises which we inherit.

*Hebrews 6:12-15* - so that you may not be sluggish, but imitators of those who through faith and patience inherit the promises.  For when God made a promise to Abraham, since he had no one greater by whom to swear, he swore by himself, saying, Surely I will bless you and multiply you.  And thus Abraham, having patiently waited, obtained the promise.

*Revelation of John 3:8* - I know your works. Behold, I have set before you an open door, which no one is able to shut. I know that you have but little power, and yet you have kept my word and have not denied my name.  Behold, I will make those of the synagogue of Satan who say that they are Jews and are not, but lie—behold, I will make them come and bow down before your feet and they will learn that I have loved you.  Because you have kept my word about *patient endurance*, I will keep you from the hour of trial that is coming on the whole world, to try those who dwell on the earth.

