docs/faith-and-judgement.tex

\subsubsection{The repentance of turning away from sin is an 'act' of faith}
\label{sec:orga505be3}
\textbf{Matthew 21:32} - For John came to you in the way of righteousness, and you did not believe him, but the tax collectors and the prostitutes believed him. And even when you saw it, you did not afterward change your minds and believe him. (ESV)

To follow the law by faith, I think, is to not lie, commit adultery, idolize, etc. in truth and reality, keeping yourself accountable to God.

This is the key, I think, to following the law by faith: \textbf{praise from God and not men}

\textbf{Romans 2:29} - But he is a Jew who is one inwardly; and circumcision is that which is of the heart, by the Spirit, not by the letter; and his praise is not from men, but from God.

\begin{itemize}
\item John the baptist taught 'turn from sin and believe in the One to come'.
\item Jesus taught to 'come to and believe in Him (Jesus) for forgiveness and stop sinning'.
\end{itemize}

Stopping sinning is important from either angle.

\begin{itemize}
\item The apostles also taught people to turn from sin, believe and stop sinning.
\end{itemize}

\textbf{John 5:14} - Afterward Jesus found him in the temple and said to him, See, you are well! Sin no more, that nothing worse may happen to you.

Examples of receiving forgiveness from Jesus.

\textbf{Matthew 9:2} - And behold, some people brought to him a paralytic, lying on a bed. And when Jesus saw their faith, he said to the paralytic, Take heart, my son; your sins are forgiven.

Forgiven after Jesus saw their faith.

\textbf{Mark 2:5} - And when Jesus saw their faith, he said to the paralytic, My son, your sins are forgiven.

Acts of faith.

\textbf{Matthew 9:5} - For which is easier, to say, Your sins are forgiven, or to say, \textbf{Rise and walk?}

\textbf{Mark 2:9} - Which is easier, to say to the paralytic, Your sins are forgiven, or to say, \textbf{Rise, take up your bed and walk?}

Turning.

\textbf{Mark 4:11-12} - And he said to them, To you has been given the secret of the kingdom of God, but for those outside everything is in parables, so that they may indeed see but not perceive, and may indeed hear but not understand, lest they should \textbf{turn} and be forgiven.

\textbf{John 8:11} - She said, No one, Lord. And Jesus said, Neither do I condemn you; go, and from now on sin no more.

\subsection{The law}
\label{sec:org30e3bc5}

\textbf{Matthew 19:4-9} - He answered, Have you not read that he who created them from the beginning made them male and female, and said, Therefore a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh? So they are no longer two but one flesh. What therefore God has joined together, let not man separate. They said to him, Why then did Moses command one to give a certificate of divorce and to send her away? He said to them, Because of your hardness of heart Moses allowed you to divorce your wives, but from the beginning it was not so. And I say to you: whoever divorces his wife, except for sexual immorality, and marries another, commits adultery. (ESV)

\textbf{Matthew 5:14-20} - You are the light of the world. A city set on a hill cannot be hidden. Nor do people light a lamp and put it under a basket, but on a stand, and it gives light to all in the house. In the same way, let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven. Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. For truly, I say to you, until heaven and earth pass away, not an iota, not a dot, will pass from the Law until all is accomplished. Therefore whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever does them and teaches them will be called great in the kingdom of heaven. For I tell you, unless your righteousness exceeds that of the scribes and Pharisees, you will never enter the kingdom of heaven. (ESV)

\textbf{Leviticus 18:22} - You shall not lie with a male as with a woman; it is an abomination. (ESV)

\textbf{Romans 7:22} - For I delight in the law of God, in my inner being, (ESV)
