docs/faith-and-judgement.org
*** The law may be pursued by faith. Justification through faith

#+BEGIN_SRC text -n :async :results verbatim code :lang text
           Faith
         /       \
    Those who     Gentiles who share
  pursue the law      the faith
    by faith          of Abraham
#+END_SRC

*Romans 9:31-32* - but that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone, (ESV)

The most important thing though is faith because it applies to both the adherent of the law and also the Gentile who has faith.

*Romans 4:16* - That is why it depends on faith, in order that the promise may rest on grace and be guaranteed to all his offspring—not only to the adherent of the law but also to the one who shares the *faith of Abraham*, who is the father of us all, (ESV)

*I Corinthians 10:1-5* - I want you to know, brothers, that our fathers were all under the cloud, and all passed through the sea, and all were baptized into Moses in the cloud and in the sea, and all ate the same spiritual food, and all drank the same spiritual drink. *For they drank from the spiritual Rock that followed them, and the Rock was Christ*.  Nevertheless, with most of them God was not pleased, for they were overthrown in the wilderness.

*** One in Christ Jesus - not excluding the adherent of the law

*Romans 10:12* - For there is no distinction between Jew and Greek; the same Lord is Lord of all, bestowing his riches on all who call on him.

*I Corinthians 12:13* - For in one Spirit we were all baptized into one body—Jews or Greeks, slaves or free—and all were made to drink of one Spirit.

*Galatians 3:28* - There is neither Jew nor Greek, there is neither slave nor free, there is neither male nor female, for you are all one in Christ Jesus.

** The law is good, if used properly - and its usage is part of the gospel
*1 Timothy 1:8-11* -  Now we know that the law is good, if one uses it lawfully, understanding this, that the law is not laid down for the just but for the lawless and disobedient, for the ungodly and sinners, for the unholy and profane, for those who strike their fathers and mothers, for murderers, the sexually immoral, men who practice homosexuality, enslavers, liars, perjurers, and whatever else is contrary to sound doctrine, in accordance with the glorious gospel of the blessed God with which I have been entrusted.  (ESV)

** Anyone who believes in Him receives forgiveness of sins
*Acts 10:43:* Of Him all *the prophets bear witness* that *through His name* everyone who believes in Him receives forgiveness of sins.”

*** The prophets
*Psalms 51:9-11* - Hide your face from my sins, and blot out all my iniquities. Create in me a clean heart, O God, and renew a right spirit within me. Cast me not away from your presence, and take not your Holy Spirit from me. (ESV)

*Zechariah 13:1* - “In that day a fountain will be opened for the house of David and for the inhabitants of Jerusalem, for sin and for impurity. (ESV)

*Isaiah 53:11* - As a result of the anguish of His soul, He will see it and be satisfied; By His knowledge the Righteous One, My Servant, will justify the many, As He will bear their iniquities. (ESV)

*Jeremiah 31:34* - They will not teach again, each man his neighbor and each man his brother, saying, ‘Know the LORD,’ for they will all know Me, from the least of them to the greatest of them,” declares the LORD, “for I will forgive their iniquity, and their sin I will remember no more.” (ESV)

*Malachi 4:2* - “But *for you who fear My name*, the sun of righteousness will rise with healing in its wings; and you will go forth and skip about like calves from the stall. (ESV)

*Daniel 9:24* - “Seventy weeks have been decreed for your people and your holy city, to finish the transgression, to make an end of sin, to make atonement for iniquity, to bring in everlasting righteousness, to seal up vision and prophecy and to anoint the most holy place.  (ESV)

*Micah 7:18* - Who is a God like You, who pardons iniquity And passes over the rebellious act of the remnant of His possession? He does not retain His anger forever, Because He delights in unchanging love. (ESV)

*2 Chronicles 7:14* -  if my people who are *called by my name* humble themselves, and pray and seek my face and turn from their wicked ways, then I will hear from heaven and will forgive their sin and heal their land.  (ESV)

