docs/faith-and-judgement.html

<div id="outline-container-org54e8e9c" class="outline-4">
<h4 id="org54e8e9c"><span class="section-number-4">5.2.1.</span> The law may be pursued by faith. Justification through faith</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>         Faith
<span class="linenr">2: </span>       /       \
<span class="linenr">3: </span>  Those who     Gentiles who share
<span class="linenr">4: </span>pursue the law      the faith
<span class="linenr">5: </span>  by faith          of Abraham
</pre>
</div>

<p>
<b>Romans 9:31-32</b> - but that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone, (ESV)
</p>

<p>
The most important thing though is faith because it applies to both the adherent of the law and also the Gentile who has faith.
</p>

<p>
<b>Romans 4:16</b> - That is why it depends on faith, in order that the promise may rest on grace and be guaranteed to all his offspring—not only to the adherent of the law but also to the one who shares the <b>faith of Abraham</b>, who is the father of us all, (ESV)
</p>

<p>
<b>I Corinthians 10:1-5</b> - I want you to know, brothers, that our fathers were all under the cloud, and all passed through the sea, and all were baptized into Moses in the cloud and in the sea, and all ate the same spiritual food, and all drank the same spiritual drink. <b>For they drank from the spiritual Rock that followed them, and the Rock was Christ</b>.  Nevertheless, with most of them God was not pleased, for they were overthrown in the wilderness.
</p>
</div>
</div>

<div id="outline-container-orgb81da3d" class="outline-4">
<h4 id="orgb81da3d"><span class="section-number-4">5.2.2.</span> One in Christ Jesus - not excluding the adherent of the law</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
<b>Romans 10:12</b> - For there is no distinction between Jew and Greek; the same Lord is Lord of all, bestowing his riches on all who call on him.
</p>

<p>
<b>I Corinthians 12:13</b> - For in one Spirit we were all baptized into one body—Jews or Greeks, slaves or free—and all were made to drink of one Spirit.
</p>

<p>
<b>Galatians 3:28</b> - There is neither Jew nor Greek, there is neither slave nor free, there is neither male nor female, for you are all one in Christ Jesus.
</p>
</div>
</div>
</div>

<div id="outline-container-org8d8db3a" class="outline-3">
<h3 id="org8d8db3a"><span class="section-number-3">5.3.</span> The law is good, if used properly - and its usage is part of the gospel</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<b>1 Timothy 1:8-11</b> -  Now we know that the law is good, if one uses it lawfully, understanding this, that the law is not laid down for the just but for the lawless and disobedient, for the ungodly and sinners, for the unholy and profane, for those who strike their fathers and mothers, for murderers, the sexually immoral, men who practice homosexuality, enslavers, liars, perjurers, and whatever else is contrary to sound doctrine, in accordance with the glorious gospel of the blessed God with which I have been entrusted.  (ESV)
</p>
</div>
</div>

<div id="outline-container-orge32f750" class="outline-3">
<h3 id="orge32f750"><span class="section-number-3">5.4.</span> Anyone who believes in Him receives forgiveness of sins</h3>
<div class="outline-text-3" id="text-5-4">
<p>
<b>Acts 10:43:</b> Of Him all <b>the prophets bear witness</b> that <b>through His name</b> everyone who believes in Him receives forgiveness of sins.”
</p>
</div>

<div id="outline-container-org51367d0" class="outline-4">
<h4 id="org51367d0"><span class="section-number-4">5.4.1.</span> The prophets</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
<b>Psalms 51:9-11</b> - Hide your face from my sins, and blot out all my iniquities. Create in me a clean heart, O God, and renew a right spirit within me. Cast me not away from your presence, and take not your Holy Spirit from me. (ESV)
</p>

<p>
<b>Zechariah 13:1</b> - “In that day a fountain will be opened for the house of David and for the inhabitants of Jerusalem, for sin and for impurity. (ESV)
</p>

<p>
<b>Isaiah 53:11</b> - As a result of the anguish of His soul, He will see it and be satisfied; By His knowledge the Righteous One, My Servant, will justify the many, As He will bear their iniquities. (ESV)
</p>

<p>
<b>Jeremiah 31:34</b> - They will not teach again, each man his neighbor and each man his brother, saying, ‘Know the LORD,’ for they will all know Me, from the least of them to the greatest of them,” declares the LORD, “for I will forgive their iniquity, and their sin I will remember no more.” (ESV)
</p>

<p>
<b>Malachi 4:2</b> - “But <b>for you who fear My name</b>, the sun of righteousness will rise with healing in its wings; and you will go forth and skip about like calves from the stall. (ESV)
</p>

<p>
<b>Daniel 9:24</b> - “Seventy weeks have been decreed for your people and your holy city, to finish the transgression, to make an end of sin, to make atonement for iniquity, to bring in everlasting righteousness, to seal up vision and prophecy and to anoint the most holy place.  (ESV)
</p>

<p>
<b>Micah 7:18</b> - Who is a God like You, who pardons iniquity And passes over the rebellious act of the remnant of His possession? He does not retain His anger forever, Because He delights in unchanging love. (ESV)
</p>

<p>
<b>2 Chronicles 7:14</b> -  if my people who are <b>called by my name</b> humble themselves, and pray and seek my face and turn from their wicked ways, then I will hear from heaven and will forgive their sin and heal their land.  (ESV)
</p>
</div>
</div>
</div>
