docs/faith-and-judgement.tex

\subsection{Faith has a quantity, and faith receives from God}
\label{sec:org9f13c8e}
\textbf{Luke 7:8-9} -  For I too am a man set under authority, with soldiers under me: and I say to one, Go, and he goes; and to another, Come, and he comes; and to my servant, Do this, and he does it.  When Jesus heard these things, he marveled at him, and turning to the crowd that followed him, said, I tell you, not even in Israel have I found such faith.  (ESV)

\subsubsection{Faith has substance, and a quantity, usually drawn out over time}
\label{sec:orgdb627f1}
\textbf{Hebrews 11:1} -  Now faith is the substance of things hoped for, the evidence of things not seen.  (KJV)

\textbf{Hebrews 11:1} - Now faith is the assurance of things hoped for, the conviction of things not seen. (ESV)

\textbf{Matthew 17:20} - He said to them, Because of your little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, Move from here to there, and it will move, and nothing will be impossible for you. (ESV)

\textbf{Revelation of John 3:8} - I know your works. Behold, I have set before you an open door, which no one is able to shut. I know that you have but little power, and yet you have kept my word and have not denied my name.  Behold, I will make those of the synagogue of Satan who say that they are Jews and are not, but lie—behold, I will make them come and bow down before your feet and they will learn that I have loved you.  Because you have \textbf{kept my word about patient endurance}, I will keep you from the hour of trial that is coming on the whole world, to try those who dwell on the earth.

I think faith is like casting a net to receive something.

If you want to catch something big then you need a lot of faith.

Faith receives salvation, and salvation is the gift which is received through faith.
Faith is something which a person must have to receive the free gift.
The onus is on us to receive the free gift.

We must approach Jesus.
We must repent (change our minds, turning from our wicked ways, and turn to God) and obey God.
God has said many things, about his statutes and about how we should listen to Jesus.
I think repentance (from the heart turning from sin) is still approaching Jesus because Jesus fulfilled the law.

Humble yourself and obey God's commandments (not out of pride, but out of authentic faith with God, being accountable to God, in secret).
Trying to turn from sin in truth and reality.

\textbf{2 Chronicles 7:14} -  if my people who are called by my name humble themselves, and pray and seek my face and turn from their wicked ways, then I will hear from heaven and will forgive their sin and heal their land.  (ESV)

\textbf{Matthew 18:3} -  and said, Truly, I say to you, unless you turn and become like children, you will never enter the kingdom of heaven.  (ESV)

It says unless \textbf{you} turn - The onus is on you.

\textbf{Matthew 5:20} - For I tell you, unless your righteousness exceeds that of the scribes and Pharisees, you will never enter the kingdom of heaven. (ESV)

It says unless \textbf{your} righteousness.

\emph{\textbf{Through faith a person is saved (the onus is on us to receive)}}

Salvation is the gift.

\textbf{Ephesians 2:8} - For by grace you have been saved through faith.  And this is not your own doing; it is the gift of God,  (ESV)

\subsubsection{The work of faith}
\label{sec:orgd102367}
\textbf{Hebrews 11:8} - By faith Abraham obeyed when he was called to go out to a place that he was to receive as an inheritance. And he went out, not knowing where he was going. (ESV)

\textbf{Hebrews 11:6} - And without faith it is impossible to please him, for whoever would draw near to God must believe that he exists and that he rewards those who seek him. (ESV)

Work substantiates faith because it is the act of receiving from God.

A work of faith could indeed be following the law in faith (as opposed to following the law by works).

For example, keeping your integrity, remaining faithful to God and not lying to God.
