docs/faith-and-judgement.org
** Great or small in the kingdom of God
*Matthew 5:6* - Blessed are those who hunger and thirst for righteousness, for they shall be satisfied.

Those who annul and teach others to break the law will be called least in the kingdom.
- It's prideful to say that God is wrong, Jesus behaved badly and that the Law is wrong
  - It refuses to acknowledge sin
Those who keep God's commandments and AND the righteousness of faith / the testimony of Jesus will be called great in the kingdom.
- This is humility to keep God's commandments by faith (and not works)

There is a self-righteous way of trying to keep the law, and there is a humble way.
- The self-righteous way
  - Pursues the law as if by works
  - Observes the law in detail but doesn't follow even the basics from the heart and in truth, or in faith.
  - Doesn't maintain being honest and faithful to God.
  - Doesn't maintain loving one's neighbour in truth and reality.
  - Lacks mercy.
  - Often criticizes others but with hypocrisy, not seeing they break the law while they accuse.
  - Often makes the mistake of condemning the innocent.
  - Often makes the mistake of being without mercy, or love.
- The humble way, with faith
  - Is accountable to God - it's not lying to God.
  - No deceit.
  - It's acknowledging that God is right, and His law is right.
  - It's loving God, and loving one's neighbour.
  - It's *compatible* with being led by the Spirit, not opposed

*Matthew 7:3-5* - Why do you see the speck that is in your brother's eye, but do not notice the log that is in your own eye? Or how can you say to your brother, Let me take the speck out of your eye, when there is the log in your own eye? You hypocrite, first take the log out of your own eye, and then you will see clearly to take the speck out of your brother's eye. (ESV)

*Galatians 5:18* - But if you are led by the Spirit, you are not under the law. Now the works of the flesh are evident: sexual immorality, impurity, sensuality, idolatry, sorcery, enmity, strife, jealousy, fits of anger, rivalries, dissensions, divisions, envy, drunkenness, orgies, and things like these. I warn you, as I warned you before, that those who do such things will not inherit the kingdom of God.

** God's kingdom is from Heaven to Earth
*Genesis 14:19* - And he blessed him and said, Blessed be Abram by God Most High, Possessor of heaven and earth;

*Isaiah 66:1* - Thus says the Lord, “Heaven is My throne and the earth is My footstool. Where then is a house you could build for Me? And where is a place that I may rest?􀀂􀁓

*Jeremiah 23:24* - “Can a man hide himself in hiding places So I do not see him?” declares the Lord. “Do I not fill the heavens and the earth?” declares the Lord.􀀂􁨬

*Acts 7:49* - ‘Heaven is My throne, And earth is the footstool of My feet; What kind of house will you build for Me?’ says the Lord, ‘Or what place is there for My repose?􀀂􌸘

*Matthew 11:25* - At that time Jesus said, “I praise You, Father, Lord of heaven and earth, that You have hidden these things from the wise and intelligent and have revealed them to infants.

*Luke 10:21* - At that very time He rejoiced greatly in the Holy Spirit, and said, “I praise You, O Father, Lord of heaven and earth, that You have hidden these things from the wise and intelligent and have revealed them to infants. Yes, Father, for this way was well-pleasing in Your sight.

*Revelation of John 14:7* - And he said with a loud voice, Fear God and give him glory, because the hour of his judgment has come, and worship him who made heaven and earth, the sea and the springs of water.

*Acts 17:24* - The God who made the world and all things in it, since He is Lord of heaven and earth, does not dwell in temples made with hands;

*** Jesus inherits the entire Kingdom
*Hebrews 1:2* - in these last days has spoken to us in His Son, whom He appointed heir of all things, through whom also He made the world.

*I Corinthians 15:25* - For He must reign until He has put all His enemies under His feet.

*I Corinthians 15:27* - For He has put all things in subjection under His feet. But when He says, “All things are put in subjection,” it is evident that He is excepted who put all things in subjection to Him.

*Ephesians 1:22* - And He put all things in subjection under His feet, and gave Him as head over all things to the church,

*Hebrews 2:8* - You have put all things in subjection under his feet.” For in subjecting all things to him, He left nothing that is not subject to him. But now we do not yet see all things subjected to him.

*Hebrews 10:13* - waiting from that time onward until His enemies be made a footstool for His feet.

