docs/faith-and-judgement.html

<div id="outline-container-orge20a487" class="outline-3">
<h3 id="orge20a487"><span class="section-number-3">6.5.</span> Great or small in the kingdom of God</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<b>Matthew 5:6</b> - Blessed are those who hunger and thirst for righteousness, for they shall be satisfied.
</p>

<p>
Those who annul and teach others to break the law will be called least in the kingdom.
</p>
<ul class="org-ul">
<li>It's prideful to say that God is wrong, Jesus behaved badly and that the Law is wrong
<ul class="org-ul">
<li>It refuses to acknowledge sin</li>
</ul></li>
</ul>
<p>
Those who keep God's commandments and AND the righteousness of faith / the testimony of Jesus will be called great in the kingdom.
</p>
<ul class="org-ul">
<li>This is humility to keep God's commandments by faith (and not works)</li>
</ul>

<p>
There is a self-righteous way of trying to keep the law, and there is a humble way.
</p>
<ul class="org-ul">
<li>The self-righteous way
<ul class="org-ul">
<li>Pursues the law as if by works</li>
<li>Observes the law in detail but doesn't follow even the basics from the heart and in truth, or in faith.</li>
<li>Doesn't maintain being honest and faithful to God.</li>
<li>Doesn't maintain loving one's neighbour in truth and reality.</li>
<li>Lacks mercy.</li>
<li>Often criticizes others but with hypocrisy, not seeing they break the law while they accuse.</li>
<li>Often makes the mistake of condemning the innocent.</li>
<li>Often makes the mistake of being without mercy, or love.</li>
</ul></li>
<li>The humble way, with faith
<ul class="org-ul">
<li>Is accountable to God - it's not lying to God.</li>
<li>No deceit.</li>
<li>It's acknowledging that God is right, and His law is right.</li>
<li>It's loving God, and loving one's neighbour.</li>
<li>It's <b>compatible</b> with being led by the Spirit, not opposed</li>
</ul></li>
</ul>

<p>
<b>Matthew 7:3-5</b> - Why do you see the speck that is in your brother's eye, but do not notice the log that is in your own eye? Or how can you say to your brother, Let me take the speck out of your eye, when there is the log in your own eye? You hypocrite, first take the log out of your own eye, and then you will see clearly to take the speck out of your brother's eye. (ESV)
</p>

<p>
<b>Galatians 5:18</b> - But if you are led by the Spirit, you are not under the law. Now the works of the flesh are evident: sexual immorality, impurity, sensuality, idolatry, sorcery, enmity, strife, jealousy, fits of anger, rivalries, dissensions, divisions, envy, drunkenness, orgies, and things like these. I warn you, as I warned you before, that those who do such things will not inherit the kingdom of God.
</p>
</div>
</div>

<div id="outline-container-orgf1f5ccd" class="outline-3">
<h3 id="orgf1f5ccd"><span class="section-number-3">6.6.</span> God's kingdom is from Heaven to Earth</h3>
<div class="outline-text-3" id="text-6-6">
<p>
<b>Genesis 14:19</b> - And he blessed him and said, Blessed be Abram by God Most High, Possessor of heaven and earth;
</p>

<p>
<b>Isaiah 66:1</b> - Thus says the Lord, “Heaven is My throne and the earth is My footstool. Where then is a house you could build for Me? And where is a place that I may rest?􀀂􀁓
</p>

<p>
<b>Jeremiah 23:24</b> - “Can a man hide himself in hiding places So I do not see him?” declares the Lord. “Do I not fill the heavens and the earth?” declares the Lord.􀀂􁨬
</p>

<p>
<b>Acts 7:49</b> - ‘Heaven is My throne, And earth is the footstool of My feet; What kind of house will you build for Me?’ says the Lord, ‘Or what place is there for My repose?􀀂􌸘
</p>

<p>
<b>Matthew 11:25</b> - At that time Jesus said, “I praise You, Father, Lord of heaven and earth, that You have hidden these things from the wise and intelligent and have revealed them to infants.
</p>

<p>
<b>Luke 10:21</b> - At that very time He rejoiced greatly in the Holy Spirit, and said, “I praise You, O Father, Lord of heaven and earth, that You have hidden these things from the wise and intelligent and have revealed them to infants. Yes, Father, for this way was well-pleasing in Your sight.
</p>

<p>
<b>Revelation of John 14:7</b> - And he said with a loud voice, Fear God and give him glory, because the hour of his judgment has come, and worship him who made heaven and earth, the sea and the springs of water.
</p>

<p>
<b>Acts 17:24</b> - The God who made the world and all things in it, since He is Lord of heaven and earth, does not dwell in temples made with hands;
</p>
</div>

<div id="outline-container-org8a7c9cc" class="outline-4">
<h4 id="org8a7c9cc"><span class="section-number-4">6.6.1.</span> Jesus inherits the entire Kingdom</h4>
<div class="outline-text-4" id="text-6-6-1">
<p>
<b>Hebrews 1:2</b> - in these last days has spoken to us in His Son, whom He appointed heir of all things, through whom also He made the world.
</p>

<p>
<b>I Corinthians 15:25</b> - For He must reign until He has put all His enemies under His feet.
</p>

<p>
<b>I Corinthians 15:27</b> - For He has put all things in subjection under His feet. But when He says, “All things are put in subjection,” it is evident that He is excepted who put all things in subjection to Him.
</p>

<p>
<b>Ephesians 1:22</b> - And He put all things in subjection under His feet, and gave Him as head over all things to the church,
</p>

<p>
<b>Hebrews 2:8</b> - You have put all things in subjection under his feet.” For in subjecting all things to him, He left nothing that is not subject to him. But now we do not yet see all things subjected to him.
</p>

<p>
<b>Hebrews 10:13</b> - waiting from that time onward until His enemies be made a footstool for His feet.
</p>
</div>
</div>
