docs/faith-and-judgement.org
*** Jesus' sheep/followers/saints inherit the Kingdom with Jesus. Jesus' sheep follow Jesus
*Luke 12:32* - Fear not, little flock, for it is your Father's good pleasure to give you the kingdom.

*John 10:27* - My sheep hear my voice, and I know them, and they follow me.

*Luke 9:23* - And he said to all, If anyone would come after me, let him deny himself and take up his cross daily and follow me.

*Luke 18:22* - When Jesus heard this, he said to him, One thing you still lack. Sell all that you have and distribute to the poor, and you will have treasure in heaven; and come, follow me.

*John 12:26* - If anyone serves me, he must follow me; and where I am, there will my servant be also. If anyone serves me, the Father will honor him.

*John 21:22* - Jesus said to him, If it is my will that he remain until I come, what is that to you? You follow me!

*1 Corinthians 6:9-20* -  Do you not know that the unrighteous will not inherit the kingdom of God?  Do not be deceived: neither the sexually immoral, nor idolaters, nor adulterers, nor men who practice homosexuality, nor thieves, nor the greedy, nor drunkards, nor revilers, nor swindlers will inherit the kingdom of God.  And such were some of you.  But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God.  All things are lawful for me, but not all things are helpful.  All things are lawful for me, but I will not be enslaved by anything.  Food is meant for the stomach and the stomach for food—and God will destroy both one and the other.  The body is not meant for sexual immorality, but for the Lord, and the Lord for the body.  And God raised the Lord and will also raise us up by his power.  Do you not know that your bodies are members of Christ?  Shall I then take the members of Christ and make them members of a prostitute?  Never! Or do you not know that he who is joined to a prostitute becomes one body with her?  For, as it is written, The two will become one flesh.  But he who is joined to the Lord becomes one spirit with him.  Flee from sexual immorality.  Every other sin a person commits is outside the body, but the sexually immoral person sins against his own body.  Or do you not know that your body is a temple of the Holy Spirit within you, whom you have from God?  You are not your own, for you were bought with a price.  So glorify God in your body.  (ESV)

*Zechariah 8:23* - Thus says the Lord of hosts: In those days ten men from the nations of every tongue shall take hold of the robe of a Jew, saying, Let us go with you, for we have heard that God is with you.

*** Followers of Jesus become fishers of men

*Mark 1:17* - And Jesus said to them, Follow me, and I will make you become fishers of men.

*** One must be born-again to enter in and inherit the Kingdom of God
*John 3:3* - Jesus answered him, Truly, truly, I say to you, unless one is born again he cannot see the kingdom of God.

*John 3:5* - Jesus answered, Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God.

*I Corinthians 15:50d* - I tell you this, brothers: flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable.

** Can gay 'marriage' exist anywhere in the Kingdom of God? Maybe. Or other religions?
I currently believe this means that grace may
exist for gay people who have faith in Jesus
but they are accountable to God for it, and
they wont *inherit* the kingdom of God and His saints.

This is my current understanding. Is this correct?

I 100% believe that anyone who puts faith in Jesus Christ for their righteousness can be saved. But that doesn't mean they inherit the Kingdom.

Also, the Kingdom stretches from heaven to earth, so gay 'marriage' may happen on earth but such a thing could never exist in heaven.

But neither does marriage between man and woman even exist in heaven.

But those who practice sexual impurity which includes homosexuality wont *inherit* the kingdom - that's for the saints (those who keep God's commandments AND have faith in Jesus).

But can they *enter* the kingdom on earth? Maybe. I believe so, actually, with the righteousness of God through faith in Jesus Christ.

*Matthew 6:10* - Your kingdom come, your will be done, on earth as it is in heaven.

I don't think God ever endorses people to sin, but has grace for sinners.

*** God's original design is male and female union and also the law reflects the spiritual reality

I saw a dark spot around my rib when I was born-again.
I think this indicates I am male, and there's a female kingdom partner out there for me!

https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection/

