docs/faith-and-judgement.html

<div id="outline-container-org611e267" class="outline-4">
<h4 id="org611e267"><span class="section-number-4">6.6.2.</span> Jesus' sheep/followers inherit the Kingdom with Jesus. Jesus' sheep follow Jesus</h4>
<div class="outline-text-4" id="text-6-6-2">
<p>
<b>Luke 12:32</b> - Fear not, little flock, for it is your Father's good pleasure to give you the kingdom.
</p>

<p>
<b>John 10:27</b> - My sheep hear my voice, and I know them, and they follow me.
</p>

<p>
<b>Luke 9:23</b> - And he said to all, If anyone would come after me, let him deny himself and take up his cross daily and follow me.
</p>

<p>
<b>Luke 18:22</b> - When Jesus heard this, he said to him, One thing you still lack. Sell all that you have and distribute to the poor, and you will have treasure in heaven; and come, follow me.
</p>

<p>
<b>John 12:26</b> - If anyone serves me, he must follow me; and where I am, there will my servant be also. If anyone serves me, the Father will honor him.
</p>

<p>
<b>John 21:22</b> - Jesus said to him, If it is my will that he remain until I come, what is that to you? You follow me!
</p>
</div>
</div>

<div id="outline-container-org4cc62e1" class="outline-4">
<h4 id="org4cc62e1"><span class="section-number-4">6.6.3.</span> Followers of Jesus become fishers of men</h4>
<div class="outline-text-4" id="text-6-6-3">
<p>
<b>Mark 1:17</b> - And Jesus said to them, Follow me, and I will make you become fishers of men.
</p>
</div>
</div>

<div id="outline-container-orgf407d97" class="outline-4">
<h4 id="orgf407d97"><span class="section-number-4">6.6.4.</span> One must be born-again to enter in and inherit the Kingdom of God</h4>
<div class="outline-text-4" id="text-6-6-4">
<p>
<b>John 3:3</b> - Jesus answered him, Truly, truly, I say to you, unless one is born again he cannot see the kingdom of God.
</p>

<p>
<b>John 3:5</b> - Jesus answered, Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God.
</p>

<p>
<b>I Corinthians 15:50d</b> - I tell you this, brothers: flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable.
</p>
</div>
</div>
</div>

<div id="outline-container-org85e721b" class="outline-3">
<h3 id="org85e721b"><span class="section-number-3">6.7.</span> Can gay 'marriage' exist anywhere in the Kingdom of God? Maybe. Or other religions?</h3>
<div class="outline-text-3" id="text-6-7">
<p>
I currently believe this means that grace may
exist for gay people who have faith in Jesus
but they are accountable to God for it, and
they wont <b>inherit</b> the kingdom of God and His saints.
</p>

<p>
This is my current understanding. Is this correct?
</p>

<p>
I 100% believe that anyone who puts faith in Jesus Christ for their righteousness can be saved. But that doesn't mean they inherit the Kingdom.
</p>

<p>
Also, the Kingdom stretches from heaven to earth, so gay 'marriage' may happen on earth but such a thing could never exist in heaven.
</p>

<p>
But neither does marriage between man and woman even exist in heaven.
</p>

<p>
But those who practice sexual impurity which includes homosexuality wont <b>inherit</b> the kingdom - that's for the saints (those who keep God's commandments AND have faith in Jesus).
</p>

<p>
But can they <b>enter</b> the kingdom on earth? Maybe. I believe so, actually, with the righteousness of God through faith in Jesus Christ.
</p>

<p>
<b>Matthew 6:10</b> - Your kingdom come, your will be done, on earth as it is in heaven.
</p>

<p>
I don't think God ever endorses people to sin, but has grace for sinners.
</p>
</div>

<div id="outline-container-orga9c8971" class="outline-4">
<h4 id="orga9c8971"><span class="section-number-4">6.7.1.</span> God's original design is male and female union and also the law reflects the spiritual reality</h4>
<div class="outline-text-4" id="text-6-7-1">
<p>
I saw a dark spot around my rib when I was born-again.
I think this indicates I am male, and there's a female kingdom partner out there for me!
</p>

<p>
<a href="https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection/">https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection/</a>
</p>
</div>
</div>
</div>
