docs/faith-and-judgement.tex

\subsubsection{Jesus' sheep/followers inherit the Kingdom with Jesus. Jesus' sheep follow Jesus}
\label{sec:org1a8ead6}
\textbf{Luke 12:32} - Fear not, little flock, for it is your Father's good pleasure to give you the kingdom.

\textbf{John 10:27} - My sheep hear my voice, and I know them, and they follow me.

\textbf{Luke 9:23} - And he said to all, If anyone would come after me, let him deny himself and take up his cross daily and follow me.

\textbf{Luke 18:22} - When Jesus heard this, he said to him, One thing you still lack. Sell all that you have and distribute to the poor, and you will have treasure in heaven; and come, follow me.

\textbf{John 12:26} - If anyone serves me, he must follow me; and where I am, there will my servant be also. If anyone serves me, the Father will honor him.

\textbf{John 21:22} - Jesus said to him, If it is my will that he remain until I come, what is that to you? You follow me!

\subsubsection{Followers of Jesus become fishers of men}
\label{sec:orgb1849b6}

\textbf{Mark 1:17} - And Jesus said to them, Follow me, and I will make you become fishers of men.

\subsubsection{One must be born-again to enter in and inherit the Kingdom of God}
\label{sec:orgb8f5d87}
\textbf{John 3:3} - Jesus answered him, Truly, truly, I say to you, unless one is born again he cannot see the kingdom of God.

\textbf{John 3:5} - Jesus answered, Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God.

\textbf{I Corinthians 15:50d} - I tell you this, brothers: flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable.

\subsection{Can gay 'marriage' exist anywhere in the Kingdom of God?}
\label{sec:org394df1c}
I currently believe this means that grace may exist for gay people who have faith in Jesus but they are accountable to God for it.
This is my current understanding. Is this correct?

Also, the Kingdom stretches from heaven to earth, so gay 'marriage' may happen on earth but such a thing could never exist in heaven.

But neither does marriage between man and woman even exist in heaven.

But those who practice sexual impurity which includes homosexuality wont \textbf{inherit} the kingdom - that's for the saints (those who keep God's commandments AND have faith in Jesus). But can they \textbf{enter} the kingdom on earth?

\textbf{Matthew 6:10} - Your kingdom come, your will be done, on earth as it is in heaven.

The question is, which I do not have the answer for, is there any place for it in God's kingdom anywhere down? Maybe, maybe not.

God's original design is male and female union and also the law reflects the spiritual reality.

I saw a dark spot around my rib when I was born-again.
I think this indicates I am male, and there's a female kingdom partner out there for me!

\url{https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection/}

I think it's really unlikely that it is tolerated anywhere in God's kingdom.

I don't think God ever endorses people to sin.
