docs/faith-and-judgement.html

<div id="outline-container-orgd729d14" class="outline-3">
<h3 id="orgd729d14"><span class="section-number-3">6.8.</span> Abiding in Christ</h3>
<div class="outline-text-3" id="text-6-8">
<ul class="org-ul">
<li>Maintaining actual belief in Jesus is the basic requirement which prevents you from being cut off
<ul class="org-ul">
<li>Believing on His name</li>
<li>He is your Saviour in reality</li>
</ul></li>
</ul>

<p>
Believe that <span class="underline">Jesus is the Christ, the Son of God</span>.
</p>

<p>
<b>Matthew 16:16</b> - Simon Peter replied, You are the Christ, the Son of the living God.
</p>

<p>
<b>John 20:31</b> - but these are written so that you may believe that Jesus is the Christ, the Son of God, and that by believing you may have life in his name.􀀁(ESV)
</p>

<p>
This is honestly just the starting point.
</p>

<p>
Continuing to believe that Jesus is the Messiah and the Only-begotten Son of God is enough to get saved, but it's not enough to be counted a disciple of Jesus.
</p>

<p>
And it's 'saved' but 'being saved' at the same time.
</p>

<p>
One wants to progress to having Jesus abide inside them.
</p>

<p>
I think that rejects His commandments but claiming to believe in Jesus Christ as the Son of God is an extremely precarious, and tentative position to be in,
and may indicate that the person doesn't <b>really</b> believe.
</p>

<p>
And if a person doesn't believe in reality, then that person probably isn't saved - so they are only lying to themself that they are saved.
</p>
</div>

<div id="outline-container-org1f71590" class="outline-4">
<h4 id="org1f71590"><span class="section-number-4">6.8.1.</span> Jesus abiding in <b>you</b> / <b>me</b></h4>
<div class="outline-text-4" id="text-6-8-1">
<p>
It quickly progresses to obeying Jesus, receiving the Spirit.
</p>

<p>
<b>I John 3:24</b> - Whoever keeps his commandments abides in him, <b>and he in them</b>. And by this we know that he abides in us, by the Spirit whom he has given us.
</p>
</div>
</div>

<div id="outline-container-orgaea0758" class="outline-4">
<h4 id="orgaea0758"><span class="section-number-4">6.8.2.</span> Loving God and loving Jesus and loving others and abiding in His love</h4>
<div class="outline-text-4" id="text-6-8-2">
<p>
<b>I John 5:2</b> - By this we know that we love the children of God, when we love God and obey his commandments.
</p>

<p>
<b>I John 5:3</b> - For this is the love of God, that we keep his commandments. And his commandments are not burdensome.
</p>

<p>
<b>II John 1:6</b> - And this is love, that we walk according to his commandments; this is the commandment, just as you have heard from the beginning, so that you should walk in it.
</p>
</div>
</div>

<div id="outline-container-orgd9fd274" class="outline-4">
<h4 id="orgd9fd274"><span class="section-number-4">6.8.3.</span> Saint - an imitator of Jesus - keeps the commandments of God AND has faith in Jesus</h4>
<div class="outline-text-4" id="text-6-8-3">
<p>
<b>John 15:10</b> - If you keep my commandments, you will abide in my love, just as I have kept my Father's commandments and abide in his love.
</p>

<p>
<b>Revelation of John 12:17</b> - Then the dragon became furious with the woman and went off to make war on the rest of her offspring, on those who keep the commandments of God and hold to the testimony of Jesus. And he stood on the sand of the sea.
</p>

<p>
<b>Revelation of John 14:12</b> - Here is a call for the endurance of the saints, those who keep the commandments of God and their faith in Jesus.
</p>
</div>
</div>

<div id="outline-container-org2cb5d00" class="outline-4">
<h4 id="org2cb5d00"><span class="section-number-4">6.8.4.</span> Followers of Jesus - the saints (people who keep God's commandments) judge the world</h4>
<div class="outline-text-4" id="text-6-8-4">
<p>
<b>Matthew 19:16-30</b> - And behold, a man came up to him, saying, Teacher, what good deed must I do to have eternal life?  And he said to him, Why do you ask me about what is good? There is only one who is good. If you would enter life, keep the commandments.  He said to him, Which ones? And Jesus said, You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and mother, and, You shall love your neighbor as yourself.  The young man said to him, All these I have kept. What do I still lack?  Jesus said to him, If you would be perfect, go, sell what you possess and give to the poor, and you will have treasure in heaven; and come, follow me.  When the young man heard this he went away sorrowful, for he had great possessions.  And Jesus said to his disciples, Truly, I say to you, only with difficulty will a rich person enter the kingdom of heaven.  Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich person to enter the kingdom of God.  When the disciples heard this, they were greatly astonished, saying, Who then can be saved?  But Jesus looked at them and said, With man this is impossible, but with God all things are possible.  Then Peter said in reply, See, we have left everything and followed you. What then will we have?  Jesus said to them, Truly, I say to you, in the new world, when the Son of Man will sit on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel.  And everyone who has left houses or brothers or sisters or father or mother or children or lands, for my name's sake, will receive a hundredfold and will inherit eternal life.  But many who are first will be last, and the last first.
</p>

<p>
<b>I Corinthians 6:2</b> - Or do you not know that the saints will judge the world? And if the world is to be judged by you, are you incompetent to try trivial cases?
</p>
</div>
</div>
