docs/faith-and-judgement.tex

\subsection{Abiding in Christ}
\label{sec:orgec44ee9}
\begin{itemize}
\item Maintaining actual belief in Jesus is the basic requirement which prevents you from being cut off
\begin{itemize}
\item Believing on His name
\item He is your Saviour in reality
\end{itemize}
\end{itemize}

Believe that \uline{Jesus is the Christ, the Son of God}.

\textbf{Matthew 16:16} - Simon Peter replied, You are the Christ, the Son of the living God.

\textbf{John 20:31} - but these are written so that you may believe that Jesus is the Christ, the Son of God, and that by believing you may have life in his name.􀀁(ESV)

This is honestly just the starting point.

Continuing to believe that Jesus is the Messiah and the Only-begotten Son of God is enough to get saved, but it's not enough to be counted a disciple of Jesus.

And it's 'saved' but 'being saved' at the same time.

One wants to progress to having Jesus abide inside them.

I think that rejects His commandments but claiming to believe in Jesus Christ as the Son of God is an extremely precarious, and tentative position to be in,
and may indicate that the person doesn't \textbf{really} believe.

And if a person doesn't believe in reality, then that person probably isn't saved - so they are only lying to themself that they are saved.

\subsubsection{Jesus abiding in \textbf{you} / \textbf{me}}
\label{sec:org2539f51}
It quickly progresses to obeying Jesus, receiving the Spirit.

\textbf{I John 3:24} - Whoever keeps his commandments abides in him, \textbf{and he in them}. And by this we know that he abides in us, by the Spirit whom he has given us.

\subsubsection{Loving God and loving Jesus and loving others and abiding in His love}
\label{sec:org2fa96b5}
\textbf{I John 5:2} - By this we know that we love the children of God, when we love God and obey his commandments.

\textbf{I John 5:3} - For this is the love of God, that we keep his commandments. And his commandments are not burdensome.

\textbf{II John 1:6} - And this is love, that we walk according to his commandments; this is the commandment, just as you have heard from the beginning, so that you should walk in it.

\subsubsection{Saint - an imitator of Jesus - keeps the commandments of God AND has faith in Jesus}
\label{sec:org949ab92}
\textbf{John 15:10} - If you keep my commandments, you will abide in my love, just as I have kept my Father's commandments and abide in his love.

\textbf{Revelation of John 12:17} - Then the dragon became furious with the woman and went off to make war on the rest of her offspring, on those who keep the commandments of God and hold to the testimony of Jesus. And he stood on the sand of the sea.

\textbf{Revelation of John 14:12} - Here is a call for the endurance of the saints, those who keep the commandments of God and their faith in Jesus.

\subsubsection{Followers of Jesus - the saints (people who keep God's commandments) judge the world}
\label{sec:orgafd7e2e}
\textbf{Matthew 19:16-30} - And behold, a man came up to him, saying, Teacher, what good deed must I do to have eternal life?  And he said to him, Why do you ask me about what is good? There is only one who is good. If you would enter life, keep the commandments.  He said to him, Which ones? And Jesus said, You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and mother, and, You shall love your neighbor as yourself.  The young man said to him, All these I have kept. What do I still lack?  Jesus said to him, If you would be perfect, go, sell what you possess and give to the poor, and you will have treasure in heaven; and come, follow me.  When the young man heard this he went away sorrowful, for he had great possessions.  And Jesus said to his disciples, Truly, I say to you, only with difficulty will a rich person enter the kingdom of heaven.  Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich person to enter the kingdom of God.  When the disciples heard this, they were greatly astonished, saying, Who then can be saved?  But Jesus looked at them and said, With man this is impossible, but with God all things are possible.  Then Peter said in reply, See, we have left everything and followed you. What then will we have?  Jesus said to them, Truly, I say to you, in the new world, when the Son of Man will sit on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel.  And everyone who has left houses or brothers or sisters or father or mother or children or lands, for my name's sake, will receive a hundredfold and will inherit eternal life.  But many who are first will be last, and the last first.

\textbf{I Corinthians 6:2} - Or do you not know that the saints will judge the world? And if the world is to be judged by you, are you incompetent to try trivial cases?
