docs/faith-and-judgement.html

<div id="outline-container-org69ce437" class="outline-4">
<h4 id="org69ce437"><span class="section-number-4">6.8.5.</span> Saints inherit the Kingdom with Jesus</h4>
<div class="outline-text-4" id="text-6-8-5">
<p>
<b>Daniel 7:18</b> -  But the saints of the Most High shall receive the kingdom and possess the kingdom forever, forever and ever.  (ESV)
</p>
</div>
</div>

<div id="outline-container-org0cfa421" class="outline-4">
<h4 id="org0cfa421"><span class="section-number-4">6.8.6.</span> Entering the kingdom of heaven</h4>
<div class="outline-text-4" id="text-6-8-6">
<p>
Jesus has to be your Lord in reality, i.e. doing Father God's will.
</p>

<p>
<b>Matthew 7:21</b> - Not everyone who says to me, Lord, Lord, will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven. (ESV)
</p>

<p>
<b>1 Thessalonians 4:3</b> -  For this is the will of God, your sanctification: that you abstain from sexual immorality;  (ESV)
</p>

<p>
<b>I Peter 2:15</b> - For this is the will of God, that by doing good you should put to silence the ignorance of foolish people.
</p>

<p>
<b>Obey</b> the word:
</p>

<p>
<b>I Peter 2:8</b> - and A stone of stumbling, and a rock of offense. They stumble because they disobey the word, as they were destined to do.
</p>

<p>
Jesus is the cornerstone. We must believe in Christ Jesus and obey His words.
</p>
</div>
</div>

<div id="outline-container-orged920e8" class="outline-4">
<h4 id="orged920e8"><span class="section-number-4">6.8.7.</span> Knowing Jesus</h4>
<div class="outline-text-4" id="text-6-8-7">
<p>
<b>I John 2:3</b> - And by this we know that we have come to know him, if we keep his commandments.
</p>

<p>
<b>I John 2:4</b> - Whoever says I know him but does not keep his commandments is a liar, and the truth is not in him,
</p>
</div>
</div>

<div id="outline-container-orgd699ccc" class="outline-4">
<h4 id="orgd699ccc"><span class="section-number-4">6.8.8.</span> His name: Jesus Christ, the Son of God</h4>
<div class="outline-text-4" id="text-6-8-8">
<p>
<b>Acts 3:16</b> - And his name—by faith in his name—has made this man strong whom you see and know, and the faith that is through Jesus has given the man this perfect health in the presence of you all.􀀁􃃨
</p>

<p>
<b>Hebrews 1:1-4</b> -  Long ago, at many times and in many ways, God spoke to our fathers by the prophets, but in these last days he has spoken to us by his Son, whom he appointed the heir of all things, through whom also he created the world.  He is the radiance of the glory of God and the exact imprint of his nature, and he upholds the universe by the word of his power.  After making purification for sins, he sat down at the right hand of the Majesty on high, having become as much superior to angels as the name he has inherited is more excellent than theirs. (ESV)
</p>

<p>
<b>Philippians 2:9-11</b> - Therefore God has highly exalted him and bestowed on him the name that is above every name, so that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, and every tongue confess that Jesus Christ is Lord, to the glory of God the Father. (ESV)
</p>

<p>
<b>John 17:11-12</b> -  And I am no longer in the world, but they are in the world, and I am coming to you.  Holy Father, keep them in your name, which you have given me, that they may be one, even as we are one.  While I was with them, I kept them in your name, which you have given me.  I have guarded them, and not one of them has been lost except the son of destruction, that the Scripture might be fulfilled. (ESV)
</p>
</div>
</div>

<div id="outline-container-orga46469c" class="outline-4">
<h4 id="orga46469c"><span class="section-number-4">6.8.9.</span> Eternal life for all whe believe in Jesus</h4>
<div class="outline-text-4" id="text-6-8-9">
<p>
<b>John 3:14-18</b> - And as Moses lifted up the serpent in the wilderness, so must the Son of Man be lifted up, that whoever believes in him may have eternal life.  For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life.  For God did not send his Son into the world to condemn the world, but in order that the world might be saved through him.  Whoever believes in him is not condemned, but whoever does not believe is condemned already, because he has not believed in the name of the only Son of God.
</p>

<p>
I believe there is a strong emphasis on continued belief.
</p>
<ul class="org-ul">
<li>'may have'</li>
<li>'should' not perish</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5b2c7b" class="outline-4">
<h4 id="orgd5b2c7b"><span class="section-number-4">6.8.10.</span> Securely abiding in Jesus, abiding in Jesus Christ's love</h4>
<div class="outline-text-4" id="text-6-8-10">
<ul class="org-ul">
<li>Loving Jesus and abiding in His love involves keeping His commandments
<ul class="org-ul">
<li>Love one another as He loved us - the same way, selflessly, forgivingly, mercifully, compassionately</li>
<li>Love God faithfully
<ul class="org-ul">
<li>An indicator is that the world hates you</li>
</ul></li>
</ul></li>
<li>Keeping all of Jesus' words, keeping His commandments
<ul class="org-ul">
<li>Ask whatever you wish</li>
</ul></li>
<li>Bear fruit
<ul class="org-ul">
<li>Forgiving others, loving others (charity, etc.)</li>
<li>Bringing others to Christ</li>
<li>Prove to be a disciple of Jesus</li>
</ul></li>
</ul>
</div>
</div>
