docs/faith-and-judgement.tex

\subsubsection{Saints inherit the Kingdom with Jesus}
\label{sec:org4181173}
\textbf{Daniel 7:18} -  But the saints of the Most High shall receive the kingdom and possess the kingdom forever, forever and ever.  (ESV)

\subsubsection{Entering the kingdom of heaven}
\label{sec:org77be3d9}
Jesus has to be your Lord in reality, i.e. doing Father God's will.

\textbf{Matthew 7:21} - Not everyone who says to me, Lord, Lord, will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven. (ESV)

\textbf{1 Thessalonians 4:3} -  For this is the will of God, your sanctification: that you abstain from sexual immorality;  (ESV)

\textbf{I Peter 2:15} - For this is the will of God, that by doing good you should put to silence the ignorance of foolish people.

\textbf{Obey} the word:

\textbf{I Peter 2:8} - and A stone of stumbling, and a rock of offense. They stumble because they disobey the word, as they were destined to do.

Jesus is the cornerstone. We must believe in Christ Jesus and obey His words.

\subsubsection{Knowing Jesus}
\label{sec:orge9a9978}
\textbf{I John 2:3} - And by this we know that we have come to know him, if we keep his commandments.

\textbf{I John 2:4} - Whoever says I know him but does not keep his commandments is a liar, and the truth is not in him,

\subsubsection{His name: Jesus Christ, the Son of God}
\label{sec:org7fd89c2}
\textbf{Acts 3:16} - And his name—by faith in his name—has made this man strong whom you see and know, and the faith that is through Jesus has given the man this perfect health in the presence of you all.􀀁􃃨

\textbf{Hebrews 1:1-4} -  Long ago, at many times and in many ways, God spoke to our fathers by the prophets, but in these last days he has spoken to us by his Son, whom he appointed the heir of all things, through whom also he created the world.  He is the radiance of the glory of God and the exact imprint of his nature, and he upholds the universe by the word of his power.  After making purification for sins, he sat down at the right hand of the Majesty on high, having become as much superior to angels as the name he has inherited is more excellent than theirs. (ESV)

\textbf{Philippians 2:9-11} - Therefore God has highly exalted him and bestowed on him the name that is above every name, so that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, and every tongue confess that Jesus Christ is Lord, to the glory of God the Father. (ESV)

\textbf{John 17:11-12} -  And I am no longer in the world, but they are in the world, and I am coming to you.  Holy Father, keep them in your name, which you have given me, that they may be one, even as we are one.  While I was with them, I kept them in your name, which you have given me.  I have guarded them, and not one of them has been lost except the son of destruction, that the Scripture might be fulfilled. (ESV)

\subsubsection{Eternal life for all whe believe in Jesus}
\label{sec:org1c87c00}
\textbf{John 3:14-18} - And as Moses lifted up the serpent in the wilderness, so must the Son of Man be lifted up, that whoever believes in him may have eternal life.  For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life.  For God did not send his Son into the world to condemn the world, but in order that the world might be saved through him.  Whoever believes in him is not condemned, but whoever does not believe is condemned already, because he has not believed in the name of the only Son of God.

I believe there is a strong emphasis on continued belief.
\begin{itemize}
\item 'may have'
\item 'should' not perish
\end{itemize}

\subsubsection{Securely abiding in Jesus, abiding in Jesus Christ's love}
\label{sec:orgb60cabd}
\begin{itemize}
\item Loving Jesus and abiding in His love involves keeping His commandments
\begin{itemize}
\item Love one another as He loved us - the same way, selflessly, forgivingly, mercifully, compassionately
\item Love God faithfully
\begin{itemize}
\item An indicator is that the world hates you
\end{itemize}
\end{itemize}
\item Keeping all of Jesus' words, keeping His commandments
\begin{itemize}
\item Ask whatever you wish
\end{itemize}
\item Bear fruit
\begin{itemize}
\item Forgiving others, loving others (charity, etc.)
\item Bringing others to Christ
\item Prove to be a disciple of Jesus
\end{itemize}
\end{itemize}
