docs/faith-and-judgement.html

<div id="outline-container-orgdfaed53" class="outline-4">
<h4 id="orgdfaed53"><span class="section-number-4">6.8.11.</span> The fruit (work) of disciples of Jesus then abides</h4>
<div class="outline-text-4" id="text-6-8-11">
<p>
<b>John 15:2</b> - Every branch of mine that does not bear fruit he takes away, and every branch that does bear fruit he prunes, that it may bear more fruit.
</p>

<p>
<b>John 15:5</b> - I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing.
</p>

<p>
<b>John 15:8</b> - By this my Father is glorified, that you bear much fruit and so prove to be my disciples.
</p>

<p>
<b>John 15:16</b> - You did not choose me, but I chose you and appointed you that you should go and bear fruit and that your fruit should abide, so that whatever you ask the Father in my name, he may give it to you.
</p>
</div>
</div>

<div id="outline-container-orgbb02683" class="outline-4">
<h4 id="orgbb02683"><span class="section-number-4">6.8.12.</span> Secure rewards and a guarantee of eternal life for Jesus' disciples</h4>
<div class="outline-text-4" id="text-6-8-12">
<p>
<b>Matthew 19:29</b> - And everyone who has left houses or brothers or sisters or father or mother or children or lands, for my name's sake, will receive a hundredfold and will inherit eternal life. (ESV)
</p>

<p>
<b>Luke 14:26-28</b> If anyone comes to me and does not hate his own father and mother and wife and children and brothers and sisters, yes, and even his own life, he cannot be my disciple. Whoever does not bear his own cross and come after me cannot be my disciple. For which of you, desiring to build a tower, does not first sit down and count the cost, whether he has enough to complete it?
</p>

<p>
<b>John 12:25</b> - Whoever loves his life loses it, and whoever hates his life in this world will keep it for eternal life. (ESV)
</p>

<p>
<b>Matthew 6:19-21</b> - Do not lay up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal, but lay up for yourselves treasures in heaven, where neither moth nor rust destroys and where thieves do not break in and steal. For where your treasure is, there your heart will be also. (ESV)
</p>
</div>
</div>
