docs/faith-and-judgement.tex

\subsubsection{The fruit (work) of disciples of Jesus then abides}
\label{sec:orgeb35e1f}
\textbf{John 15:2} - Every branch of mine that does not bear fruit he takes away, and every branch that does bear fruit he prunes, that it may bear more fruit.

\textbf{John 15:5} - I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing.

\textbf{John 15:8} - By this my Father is glorified, that you bear much fruit and so prove to be my disciples.

\textbf{John 15:16} - You did not choose me, but I chose you and appointed you that you should go and bear fruit and that your fruit should abide, so that whatever you ask the Father in my name, he may give it to you.

\subsubsection{Secure rewards and a guarantee of eternal life for Jesus' disciples}
\label{sec:org43cfa23}

\textbf{Matthew 19:29} - And everyone who has left houses or brothers or sisters or father or mother or children or lands, for my name's sake, will receive a hundredfold and will inherit eternal life. (ESV)

\textbf{Luke 14:26-28} If anyone comes to me and does not hate his own father and mother and wife and children and brothers and sisters, yes, and even his own life, he cannot be my disciple. Whoever does not bear his own cross and come after me cannot be my disciple. For which of you, desiring to build a tower, does not first sit down and count the cost, whether he has enough to complete it?

\textbf{John 12:25} - Whoever loves his life loses it, and whoever hates his life in this world will keep it for eternal life. (ESV)

\textbf{Matthew 6:19-21} - Do not lay up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal, but lay up for yourselves treasures in heaven, where neither moth nor rust destroys and where thieves do not break in and steal. For where your treasure is, there your heart will be also. (ESV)
