docs/faith-and-judgement.tex

\subsubsection{God the Father can graft people in and out of Christ}
\label{sec:org1945895}
So take stopping sin seriously, and keep Jesus' words and His commandments, and also bearing fruit for Jesus.

And, most importantly, believe in Jesus, and that he has paid the price for your sin with His blood.

\textbf{John 15} - I am the true vine, and my Father is the vinedresser.  Every branch of mine that does not bear fruit he takes away, and every branch that does bear fruit he prunes, that it may bear more fruit.  Already you are clean because of the word that I have spoken to you.  Abide in me, and I in you. As the branch cannot bear fruit by itself, unless it abides in the vine, neither can you, unless you abide in me.  I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing.  If anyone does not abide in me he is thrown away like a branch and withers; and the branches are gathered, thrown into the fire, and burned.  If you abide in me, and my words abide in you, ask whatever you wish, and it will be done for you.  By this my Father is glorified, that you bear much fruit and so prove to be my disciples.  As the Father has loved me, so have I loved you. Abide in my love.  If you keep my commandments, you will abide in my love, just as I have kept my Father's commandments and abide in his love.  These things I have spoken to you, that my joy may be in you, and that your joy may be full.  This is my commandment, that you love one another as I have loved you.  Greater love has no one than this, that someone lays down his life for his friends.  You are my friends if you do what I command you.  No longer do I call you servants, for the servant does not know what his master is doing; but I have called you friends, for all that I have heard from my Father I have made known to you.  You did not choose me, but I chose you and appointed you that you should go and bear fruit and that your fruit should abide, so that whatever you ask the Father in my name, he may give it to you.  These things I command you, so that you will love one another.  If the world hates you, know that it has hated me before it hated you.  If you were of the world, the world would love you as its own; but because you are not of the world, but I chose you out of the world, therefore the world hates you.  Remember the word that I said to you: A servant is not greater than his master. If they persecuted me, they will also persecute you. If they kept my word, they will also keep yours.  But all these things they will do to you on account of my name, because they do not know him who sent me.  If I had not come and spoken to them, they would not have been guilty of sin, but now they have no excuse for their sin.  Whoever hates me hates my Father also.  If I had not done among them the works that no one else did, they would not be guilty of sin, but now they have seen and hated both me and my Father.  But the word that is written in their Law must be fulfilled: They hated me without a cause.  But when the Helper comes, whom I will send to you from the Father, the Spirit of truth, who proceeds from the Father, he will bear witness about me.  And you also will bear witness, because you have been with me from the beginning.

\textbf{Romans 11} - I ask, then, has God rejected his people? By no means! For I myself am an Israelite, a descendant of Abraham, a member of the tribe of Benjamin. God has not rejected his people whom he foreknew. Do you not know what the Scripture says of Elijah, how he appeals to God against Israel? Lord, they have killed your prophets, they have demolished your altars, and I alone am left, and they seek my life. But what is God's reply to him? I have kept for myself seven thousand men who have not bowed the knee to Baal. So too at the present time there is a remnant, chosen by grace. But if it is by grace, it is no longer on the basis of works; otherwise grace would no longer be grace. What then? Israel failed to obtain what it was seeking. The elect obtained it, but the rest were hardened, as it is written, God gave them a spirit of stupor, eyes that would not see and ears that would not hear, down to this very day. And David says, Let their table become a snare and a trap, a stumbling block and a retribution for them; let their eyes be darkened so that they cannot see, and bend their backs forever. So I ask, did they stumble in order that they might fall? By no means! Rather through their trespass salvation has come to the Gentiles, so as to make Israel jealous. Now if their trespass means riches for the world, and if their failure means riches for the Gentiles, how much more will their full inclusion mean! Now I am speaking to you Gentiles. Inasmuch then as I am an apostle to the Gentiles, I magnify my ministry in order somehow to make my fellow Jews jealous, and thus save some of them. For if their rejection means the reconciliation of the world, what will their acceptance mean but life from the dead? If the dough offered as firstfruits is holy, so is the whole lump, and if the root is holy, so are the branches. But if some of the branches were broken off, and you, although a wild olive shoot, were grafted in among the others and now share in the nourishing root of the olive tree, do not be arrogant toward the branches. If you are, remember it is not you who support the root, but the root that supports you. Then you will say, Branches were broken off so that I might be grafted in. That is true. They were broken off because of their unbelief, but you stand fast through faith. So do not become proud, but stand in awe. For if God did not spare the natural branches, neither will he spare you. Note then the kindness and the severity of God: severity toward those who have fallen, but God's kindness to you, provided you continue in his kindness. Otherwise you too will be cut off. And even they, if they do not continue in their unbelief, will be grafted in, for God has the power to graft them in again. For if you were cut from what is by nature a wild olive tree, and grafted, contrary to nature, into a cultivated olive tree, how much more will these, the natural branches, be grafted back into their own olive tree. Lest you be wise in your own conceits, I want you to understand this mystery, brothers: a partial hardening has come upon Israel, until the fullness of the Gentiles has come in. And in this way all Israel will be saved, as it is written, The Deliverer will come from Zion, he will banish ungodliness from Jacob; and this will be my covenant with them when I take away their sins. As regards the gospel, they are enemies of God for your sake. But as regards election, they are beloved for the sake of their forefathers. For the gifts and the calling of God are irrevocable. Just as you were at one time disobedient to God but now have received mercy because of their disobedience, so they too have now been disobedient in order that by the mercy shown to you they also may now receive mercy. For God has consigned all to disobedience, that he may have mercy on all. Oh, the depth of the riches and wisdom and knowledge of God! How unsearchable are his judgments and how inscrutable his ways! For who has known the mind of the Lord, or who has been his counselor? Or who has given a gift to him that he might be repaid? For from him and through him and to him are all things. To him be glory forever. Amen. (ESV)

\textbf{Matthew 12:33-37} -  Either make the tree good and its fruit good, or make the tree bad and its fruit bad, for the tree is known by its fruit.  You brood of vipers! How can you speak good, when you are evil?  For out of the abundance of the heart the mouth speaks.  The good person out of his good treasure brings forth good, and the evil person out of his evil treasure brings forth evil.  I tell you, on the day of judgment people will give account for every careless word they speak, for by your words you will be justified, and by your words you will be condemned.  (ESV)
