docs/faith-and-judgement.org
*** The law of Christ
We are still /under/ a 'law of faith', but we are not *under* the Mosaic law.

We are under the law of Christ which is a law of faith.

But the Mosaic law still exists.

*I Corinthians 9:21* - To those outside the law I became as one outside the law (not being outside the law of God but under the law of Christ) that I might win those outside the law.

*Galatians 6:2* - Bear one another's burdens, and so fulfill the law of Christ.

*I John 3:4-11* - Everyone who makes a practice of sinning also practices lawlessness; sin is lawlessness.  You know that he appeared to take away sins, and in him there is no sin.  No one who abides in him keeps on sinning; no one who keeps on sinning has either seen him or known him.  Little children, let no one deceive you. Whoever practices righteousness is righteous, as he is righteous.  Whoever makes a practice of sinning is of the devil, for the devil has been sinning from the beginning. The reason the Son of God appeared was to destroy the works of the devil.  No one born of God makes a practice of sinning, for God's seed abides in him, and he cannot keep on sinning because he has been born of God.  By this it is evident who are the children of God, and who are the children of the devil: whoever does not practice righteousness is not of God, nor is the one who does not love his brother.  For this is the message that you have heard from the beginning, that we should love one another.

** The truth is God made them male and female, but handed erroneous, rebellious people over to their lust in impurity
*Genesis 1:27* - So God created man in his own image, in the image of God he created him; male and female he created them.

*Genesis 5:2* - Male and female he created them, and he blessed them and named them Man when they were created.

*Genesis 6:19* - And of every living thing of all flesh, you shall bring two of every sort into the ark to keep them alive with you. They shall be male and female.

*Joel 2:27-29* - You shall know that I am in the midst of Israel, and that I am the Lord your God and there is none else. And my people shall never again be put to shame.  And it shall come to pass afterward, that I will pour out my Spirit on all flesh; your sons and your daughters shall prophesy, your old men shall dream dreams, and your young men shall see visions.  Even on the male and female servants in those days I will pour out my Spirit. (ESV)

*Matthew 19:4* - He answered, Have you not read that he who created them from the beginning made them male and female, (ESV)

*Mark 10:6* - But from the beginning of creation, God made them male and female. (ESV)

*Romans 1:24-32* - Therefore God gave them up in the lusts of their hearts to impurity, to the dishonoring of their bodies among themselves, because they exchanged the truth about God for a lie and worshiped and served the creature rather than the Creator, who is blessed forever! Amen.  For this reason God gave them up to dishonorable passions.  For their women exchanged natural relations for those that are contrary to nature; and the men likewise gave up natural relations with women and were consumed with passion for one another, men committing shameless acts with men and receiving in themselves the due penalty for their error.  And since they did not see fit to acknowledge God, God gave them up to a debased mind to do what ought not to be done.  They were filled with all manner of unrighteousness, evil, covetousness, malice.  They are full of envy, murder, strife, deceit, maliciousness.  They are gossips, slanderers, haters of God, insolent, haughty, boastful, inventors of evil, disobedient to parents, foolish, faithless, heartless, ruthless.  Though they know God's decree that those who practice such things deserve to die, they not only do them but give approval to those who practice them.  (ESV)

