docs/faith-and-judgement.org
** I do not endorse gay marriage
I personally do not endorse gay marriage. When I have in the past, I repent of that. That is not to say it is not possible to endorse it yourself but a person is accountable to God for that act of annulling one of His commandments.

In the manner in which I judge, I know I will be judged. So I believe that because I do not / no longer endorse gay marriage for others, I do not endorse it for myself, and I'll be held to that standard.

*Matthew 5:14* - You are the light of the world.  A city set on a hill cannot be hidden.  (ESV)

I know I am called to exercise personal righteousness/holiness as the light of the world. I believe that God's grace extends to all who put their faith in Jesus and have Jesus' righteousness imputed onto them, the righteousness of faith in Jesus Christ God's Son who has paid through his blood the price for our sin.

I believe one must know that God's law is right and when presented with God's law, they recognise that the law is right and recognise their transgression.

And no-one should endorse sinful things. Homosexuality is erroneous.
If they do, however, endorse it then I think that inhibits them from approaching God.

I feel as though I have been robbed in my life of normal Christian marriage by endorsing it for others in the past.

** Belief comes before or at the time of receiving the Holy Spirit (receiving the Holy Spirit comes at the time of or after believing)
I believe that the Holy Spirit goes to those who obey God. I believe belief in Jesus comes first.

*Acts 2:38* - And Peter said to them, Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit. (ESV)

*Acts 5:32* - And we are witnesses to these things, and so is the Holy Spirit, whom God has given to those who obey him. (ESV)

Belief in Jesus comes first but receiving the Holy Spirit and baptism may happen in any order after that.

I think this is generally the order of things.

** God is sovereign to reveal Himself, sovereign to save and sovereign to destroy

*Romans 10:20* - Then Isaiah is so bold as to say, I have been found by those who did not seek me; I have shown myself to those who did not ask for me. (ESV)

*Matthew 10:28* - And do not fear those who kill the body but cannot kill the soul. Rather fear him who can destroy both soul and body in hell.

A creed doesn't guarantee that a person is saved.

God chooses who is saved, and how they are saved.
God justifies.

*Jude 1:24-25* - Now to him who is able to keep you from stumbling and to present you blameless before the presence of his glory with great joy, to the only God, our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and forever. Amen.

*I Peter 2:25* - For you were straying like sheep, but have now returned to the Shepherd and Overseer of your souls.

** Outside of the Holy Spirit, noone can say Jesus is Lord

*1 Corinthians 12:3* - Therefore I want you to understand that no one speaking in the Spirit of God ever says Jesus is accursed! and no one can say Jesus is Lord except in the Holy Spirit. (ESV)

** Works accompany the true believers
*Mark 16:16-17* - Whoever believes and is baptized will be saved, but whoever does not believe will be condemned. And these signs will accompany those who believe: in my name they will cast out demons; they will speak in new tongues; (ESV)

** Those that reject the gospel are not the same as those who haven't heard the gospel
*Mark 6:11* - And if any place will not receive you and they will not listen to you, when you leave, shake off the dust that is on your feet as a testimony against them.

*John 13:20* - Truly, truly, I say to you, whoever receives the one I send receives me, and whoever receives me receives the one who sent me.

*Matthew 10:40* - “He who receives you receives Me, and he who receives Me receives Him who sent Me.

*Mark 9:37* - “Whoever receives one child like this in My name receives Me; and whoever receives Me does not receive Me, but Him who sent Me.”

I lean towards this interpretation:

People who hear the gospel and reject it / reject Jesus / choose to not believe are condemned.

