docs/faith-and-judgement.html

<div id="outline-container-org544b69d" class="outline-3">
<h3 id="org544b69d"><span class="section-number-3">6.10.</span> I do not endorse gay marriage</h3>
<div class="outline-text-3" id="text-6-10">
<p>
I personally do not endorse gay marriage. When I have in the past, I repent of that. That is not to say it is not possible to endorse it yourself but a person is accountable to God for that act of annulling one of His commandments.
</p>

<p>
In the manner in which I judge, I know I will be judged. So I believe that because I do not / no longer endorse gay marriage for others, I do not endorse it for myself, and I'll be held to that standard.
</p>

<p>
<b>Matthew 5:14</b> - You are the light of the world.  A city set on a hill cannot be hidden.  (ESV)
</p>

<p>
I know I am called to exercise personal righteousness/holiness as the light of the world. I believe that God's grace extends to all who put their faith in Jesus and have Jesus' righteousness imputed onto them, the righteousness of faith in Jesus Christ God's Son who has paid through his blood the price for our sin.
</p>

<p>
I believe one must know that God's law is right and when presented with God's law, they recognise that the law is right and recognise their transgression.
</p>

<p>
And no-one should endorse sinful things. Homosexuality is erroneous.
If they do, however, endorse it then I think that inhibits them from approaching God.
</p>

<p>
I feel as though I have been robbed in my life of normal Christian marriage by endorsing it for others in the past.
</p>
</div>
</div>

<div id="outline-container-org819dc6f" class="outline-3">
<h3 id="org819dc6f"><span class="section-number-3">6.11.</span> Belief comes before or at the time of receiving the Holy Spirit (receiving the Holy Spirit comes at the time of or after believing)</h3>
<div class="outline-text-3" id="text-6-11">
<p>
I believe that the Holy Spirit goes to those who obey God. I believe belief in Jesus comes first.
</p>

<p>
<b>Acts 2:38</b> - And Peter said to them, Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit. (ESV)
</p>

<p>
<b>Acts 5:32</b> - And we are witnesses to these things, and so is the Holy Spirit, whom God has given to those who obey him. (ESV)
</p>

<p>
Belief in Jesus comes first but receiving the Holy Spirit and baptism may happen in any order after that.
</p>

<p>
I think this is generally the order of things.
</p>
</div>
</div>

<div id="outline-container-orgf39d749" class="outline-3">
<h3 id="orgf39d749"><span class="section-number-3">6.12.</span> God is sovereign to reveal Himself, sovereign to save and sovereign to destroy</h3>
<div class="outline-text-3" id="text-6-12">
<p>
<b>Romans 10:20</b> - Then Isaiah is so bold as to say, I have been found by those who did not seek me; I have shown myself to those who did not ask for me. (ESV)
</p>

<p>
<b>Matthew 10:28</b> - And do not fear those who kill the body but cannot kill the soul. Rather fear him who can destroy both soul and body in hell.
</p>

<p>
A creed doesn't guarantee that a person is saved.
</p>

<p>
God chooses who is saved, and how they are saved.
God justifies.
</p>

<p>
<b>Jude 1:24-25</b> - Now to him who is able to keep you from stumbling and to present you blameless before the presence of his glory with great joy, to the only God, our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and forever. Amen.
</p>

<p>
<b>I Peter 2:25</b> - For you were straying like sheep, but have now returned to the Shepherd and Overseer of your souls.
</p>
</div>
</div>

<div id="outline-container-org0e85e65" class="outline-3">
<h3 id="org0e85e65"><span class="section-number-3">6.13.</span> Outside of the Holy Spirit, noone can say Jesus is Lord</h3>
<div class="outline-text-3" id="text-6-13">
<p>
<b>1 Corinthians 12:3</b> - Therefore I want you to understand that no one speaking in the Spirit of God ever says Jesus is accursed! and no one can say Jesus is Lord except in the Holy Spirit. (ESV)
</p>
</div>
</div>

<div id="outline-container-orgd18690c" class="outline-3">
<h3 id="orgd18690c"><span class="section-number-3">6.14.</span> Works accompany the true believers</h3>
<div class="outline-text-3" id="text-6-14">
<p>
<b>Mark 16:16-17</b> - Whoever believes and is baptized will be saved, but whoever does not believe will be condemned. And these signs will accompany those who believe: in my name they will cast out demons; they will speak in new tongues; (ESV)
</p>
</div>
</div>

<div id="outline-container-org5891829" class="outline-3">
<h3 id="org5891829"><span class="section-number-3">6.15.</span> Those that reject the gospel are not the same as those who haven't heard the gospel</h3>
<div class="outline-text-3" id="text-6-15">
<p>
<b>Mark 6:11</b> - And if any place will not receive you and they will not listen to you, when you leave, shake off the dust that is on your feet as a testimony against them.
</p>

<p>
<b>John 13:20</b> - Truly, truly, I say to you, whoever receives the one I send receives me, and whoever receives me receives the one who sent me.
</p>

<p>
<b>Matthew 10:40</b> - “He who receives you receives Me, and he who receives Me receives Him who sent Me.
</p>

<p>
<b>Mark 9:37</b> - “Whoever receives one child like this in My name receives Me; and whoever receives Me does not receive Me, but Him who sent Me.”
</p>

<p>
I lean towards this interpretation:
</p>

<p>
People who hear the gospel and reject it / reject Jesus / choose to not believe are condemned.
</p>
</div>
</div>
