docs/faith-and-judgement.html

<div id="outline-container-org874f385" class="outline-3">
<h3 id="org874f385"><span class="section-number-3">6.16.</span> I believe that repentance is important in faith and faithfulness to God (lots of people say these days that trying to follow the law is self-righteousness; they believe good is evil), but following the law in faith is OK</h3>
<div class="outline-text-3" id="text-6-16">
<p>
<b>Matthew 21:32</b> - For John came to you in the way of righteousness, and you did not believe him, but the tax collectors and the prostitutes believed him. And even when you saw it, you did not afterward change your minds and believe him. (ESV)
</p>

<p>
<b>Acts 2:38</b> - And Peter said to them, Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit. (ESV)
</p>

<p>
Basic repentance is 'metanoia' (a change of mind) - it's part of belief.
But this is what repentance looks like.
</p>

<p>
<b>Joel 2:12-13</b> - Yet even now, declares the LORD, return to me with all your heart, with fasting, with weeping, and with mourning; and rend your hearts and not your garments. Return to the LORD, your God, for he is gracious and merciful, slow to anger, and abounding in steadfast love; and he relents over disaster. (ESV)
</p>

<p>
And repentance has the fruit of in your heart truly deciding to tell the truth, not commit adultery, etc. - being accountable to God, knowing that He sees.
</p>

<p>
<b>Matthew 3:8</b> - Bear fruit in keeping with repentance.  (ESV)
</p>

<p>
This is following the law by faith, I think; Truly loving God and one's neighbour.
</p>

<p>
<b>Romans 14:23</b> - But whoever has doubts is condemned if he eats, because the eating is not from faith. For whatever does not proceed from faith is sin. (ESV)
</p>
</div>
</div>

<div id="outline-container-org02b065a" class="outline-3">
<h3 id="org02b065a"><span class="section-number-3">6.17.</span> Celebrating/endorsing sin / error is not right</h3>
<div class="outline-text-3" id="text-6-17">
<p>
If a newly born-again Christian is spending all their time with sinners though and endorsing continually instead of being discipled, then they can
have their mind conformed to the sinners instead of being strengthened in the truth. This is why I think it's not especially great to, immediately after getting born-again,
be overly exposed to unbelievers and sinners.
</p>

<p>
Jesus ate with sinners but Jesus was the special guest. Think of Nicodemus inviting Jesus over.
</p>
</div>
</div>

<div id="outline-container-org2a5484a" class="outline-3">
<h3 id="org2a5484a"><span class="section-number-3">6.18.</span> Faith has substance to it, and an amount to it, usually drawn out over time</h3>
<div class="outline-text-3" id="text-6-18">
<p>
<b>Hebrews 11:1</b> - Now faith is the substance of things hoped for, the evidence of things not seen. (KJV)
</p>

<p>
For me, I was acting in faith ever since I was born-again, resulting in a huge chain of events and confirmations!
</p>
</div>
</div>

<div id="outline-container-org2596f36" class="outline-3">
<h3 id="org2596f36"><span class="section-number-3">6.19.</span> Faith believes God and hopes in invisible things, and is convicted of them</h3>
<div class="outline-text-3" id="text-6-19">
<p>
But at the end of the day, justification by faith in Jesus justifies the ungodly sinner - but it is faith that God justifies and not faithlessness. It's the type of belief that recognises one's sin, and results in love for Jesus, and it's obedient and submissive to God - it's repentant.
</p>

<p>
<b>Hebrews 11:6</b> - And without faith it is impossible to please him, for whoever would draw near to God must believe that he exists and that he rewards those who seek him. (ESV)
</p>

<p>
Where we are unfaithful, though, God is faithful. God wants us to choose Him. He wants us to repent.
</p>
</div>
</div>

<div id="outline-container-orgd911507" class="outline-3">
<h3 id="orgd911507"><span class="section-number-3">6.20.</span> Who chooses who? I believe Jesus chose me and I also choose Jesus every day but Jesus chose me first</h3>
<div class="outline-text-3" id="text-6-20">
<p>
<b>John 15:16</b> - You did not choose me, but I chose you and appointed you that you should go and bear fruit and that your fruit should abide, so that whatever you ask the Father in my name, he may give it to you. (ESV)
</p>
</div>
</div>

<div id="outline-container-org1f19b47" class="outline-3">
<h3 id="org1f19b47"><span class="section-number-3">6.21.</span> Jesus' words never pass away. Neither does the law</h3>
<div class="outline-text-3" id="text-6-21">
<p>
<b>Psalms 119:160</b> - The sum of your word is truth, and every one of your righteous rules endures forever. (ESV)
</p>

<p>
<b>Matthew 11:25</b> - At that time Jesus declared, I thank you, Father, Lord of heaven and earth, that you have hidden these things from the wise and understanding and revealed them to little children;
</p>

<p>
<b>Matthew 24:35</b> - Heaven and earth will pass away, but my words will not pass away.
</p>

<p>
<b>Mark 13:31</b> - Heaven and earth will pass away, but my words will not pass away.
</p>

<p>
<b>Luke 10:21</b> - In that same hour he rejoiced in the Holy Spirit and said, I thank you, Father, Lord of heaven and earth, that you have hidden these things from the wise and understanding and revealed them to little children; yes, Father, for such was your gracious will.
</p>

<p>
<b>Luke 16:17</b> - But it is easier for heaven and earth to pass away than for one dot of the Law to become void.
</p>

<p>
<b>Luke 21:33</b> - Heaven and earth will pass away, but my words will not pass away.
</p>
</div>
</div>
