docs/faith-and-judgement.tex

\subsection{I believe that repentance is important in faith and faithfulness to God (lots of people say these days that trying to follow the law is self-righteousness; they believe good is evil), but following the law in faith is OK}
\label{sec:org12ee5f0}

\textbf{Matthew 21:32} - For John came to you in the way of righteousness, and you did not believe him, but the tax collectors and the prostitutes believed him. And even when you saw it, you did not afterward change your minds and believe him. (ESV)

\textbf{Acts 2:38} - And Peter said to them, Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit. (ESV)

Basic repentance is 'metanoia' (a change of mind) - it's part of belief.
But this is what repentance looks like.

\textbf{Joel 2:12-13} - Yet even now, declares the LORD, return to me with all your heart, with fasting, with weeping, and with mourning; and rend your hearts and not your garments. Return to the LORD, your God, for he is gracious and merciful, slow to anger, and abounding in steadfast love; and he relents over disaster. (ESV)

And repentance has the fruit of in your heart truly deciding to tell the truth, not commit adultery, etc. - being accountable to God, knowing that He sees.

\textbf{Matthew 3:8} - Bear fruit in keeping with repentance.  (ESV)

This is following the law by faith, I think; Truly loving God and one's neighbour.

\textbf{Romans 14:23} - But whoever has doubts is condemned if he eats, because the eating is not from faith. For whatever does not proceed from faith is sin. (ESV)

\subsection{Celebrating/endorsing sin / error is not right}
\label{sec:org23c83c7}

If a newly born-again Christian is spending all their time with sinners though and endorsing continually instead of being discipled, then they can
have their mind conformed to the sinners instead of being strengthened in the truth. This is why I think it's not especially great to, immediately after getting born-again,
be overly exposed to unbelievers and sinners.

Jesus ate with sinners but Jesus was the special guest. Think of Nicodemus inviting Jesus over.

\subsection{Faith has substance to it, and an amount to it, usually drawn out over time}
\label{sec:org771479a}
\textbf{Hebrews 11:1} - Now faith is the substance of things hoped for, the evidence of things not seen. (KJV)

For me, I was acting in faith ever since I was born-again, resulting in a huge chain of events and confirmations!

\subsection{Faith believes God and hopes in invisible things, and is convicted of them}
\label{sec:org0c1927e}

But at the end of the day, justification by faith in Jesus justifies the ungodly sinner - but it is faith that God justifies and not faithlessness. It's the type of belief that recognises one's sin, and results in love for Jesus, and it's obedient and submissive to God - it's repentant.

\textbf{Hebrews 11:6} - And without faith it is impossible to please him, for whoever would draw near to God must believe that he exists and that he rewards those who seek him. (ESV)

Where we are unfaithful, though, God is faithful. God wants us to choose Him. He wants us to repent.

\subsection{Who chooses who? I believe Jesus chose me and I also choose Jesus every day but Jesus chose me first}
\label{sec:org68fd3c3}
\textbf{John 15:16} - You did not choose me, but I chose you and appointed you that you should go and bear fruit and that your fruit should abide, so that whatever you ask the Father in my name, he may give it to you. (ESV)

\subsection{Jesus' words never pass away. Neither does the law}
\label{sec:org571871c}
\textbf{Psalms 119:160} - The sum of your word is truth, and every one of your righteous rules endures forever. (ESV)

\textbf{Matthew 11:25} - At that time Jesus declared, I thank you, Father, Lord of heaven and earth, that you have hidden these things from the wise and understanding and revealed them to little children;

\textbf{Matthew 24:35} - Heaven and earth will pass away, but my words will not pass away.

\textbf{Mark 13:31} - Heaven and earth will pass away, but my words will not pass away.

\textbf{Luke 10:21} - In that same hour he rejoiced in the Holy Spirit and said, I thank you, Father, Lord of heaven and earth, that you have hidden these things from the wise and understanding and revealed them to little children; yes, Father, for such was your gracious will.

\textbf{Luke 16:17} - But it is easier for heaven and earth to pass away than for one dot of the Law to become void.

\textbf{Luke 21:33} - Heaven and earth will pass away, but my words will not pass away.
