docs/faith-and-judgement.org
** Structure of the Kingdom

The law still exists. A thought I have : "Perhaps structure of God's kingdom might be determined by the law and Jesus' words."

*Psalms 119:160* - The sum of your word is truth, and every one of your righteous rules endures forever. (ESV)

Heaven is God's throne and its foundation is righteousness and justice.

*Psalms 97:2* - Clouds and thick darkness are all around him; righteousness and justice are the foundation of his throne.

*Psalms 89:14* - Righteousness and justice are the foundation of your throne; steadfast love and faithfulness go before you. (ESV)

*Acts 7:49* - ‘Heaven is My throne, And earth is the footstool of My feet; What kind of house will you build for Me?’ says the Lord, ‘Or what place is there for My repose?

The universe is upheld by the word of Jesus' power.

*Hebrews 1:3* - He is the radiance of the glory of God and the exact imprint of his nature, and he upholds the universe by the word of his power. After making purification for sins, he sat down at the right hand of the Majesty on high, (ESV)

*Revelation of John 20:4* - Then I saw thrones, and seated on them were those to whom the authority to judge was committed. Also I saw the souls of those who had been beheaded for the testimony of Jesus and for the word of God, and who had not worshiped the beast or its image and had not received its mark on their foreheads or their hands. They came to life and reigned with Christ for a thousand years.

** There is no sexual immorality in Heaven, no violence, no sinners.
Heaven is not Earth. It's a place without sinning.

But the Kingdom of God exists from Heaven to Earth.

*Revelation 21:22-27* - And I saw no temple in the city, for its temple is the Lord God the Almighty and the Lamb. And the city has no need of sun or moon to shine on it, for the glory of God gives it light, and its lamp is the Lamb. By its light will the nations walk, and the kings of the earth will bring their glory into it, and its gates will never be shut by day—and there will be no night there. They will bring into it the glory and the honor of the nations. But nothing unclean will ever enter it, nor anyone who does what is detestable or false, but only those who are written in the Lamb's book of life. (ESV)

*Isaiah 11:6* - The wolf shall dwell with the lamb, and the leopard shall lie down with the young goat, and the calf and the lion and the fattened calf together; and a little child shall lead them. (ESV)

*Matthew 22:30* - For in the resurrection they neither marry nor are given in marriage, but are like angels in heaven.

** Adhering to the law like a Pharisee - pursuing the law by works
But adhering to the law like a Pharisee is like strapping yourself to a razor blade, but that doesn't mean the law is wrong.

*Romans 3:20* - For by works of the law no human being will be justified in his sight, since through the law comes knowledge of sin.

