docs/faith-and-judgement.html

<div id="outline-container-org45e7ea0" class="outline-3">
<h3 id="org45e7ea0"><span class="section-number-3">6.22.</span> Structure of the Kingdom</h3>
<div class="outline-text-3" id="text-6-22">
<p>
The law still exists. A thought I have : "Perhaps structure of God's kingdom might be determined by the law and Jesus' words."
</p>

<p>
<b>Psalms 119:160</b> - The sum of your word is truth, and every one of your righteous rules endures forever. (ESV)
</p>

<p>
Heaven is God's throne and its foundation is righteousness and justice.
</p>

<p>
<b>Psalms 97:2</b> - Clouds and thick darkness are all around him; righteousness and justice are the foundation of his throne.
</p>

<p>
<b>Psalms 89:14</b> - Righteousness and justice are the foundation of your throne; steadfast love and faithfulness go before you. (ESV)
</p>

<p>
<b>Acts 7:49</b> - ‘Heaven is My throne, And earth is the footstool of My feet; What kind of house will you build for Me?’ says the Lord, ‘Or what place is there for My repose?
</p>

<p>
The universe is upheld by the word of Jesus' power.
</p>

<p>
<b>Hebrews 1:3</b> - He is the radiance of the glory of God and the exact imprint of his nature, and he upholds the universe by the word of his power. After making purification for sins, he sat down at the right hand of the Majesty on high, (ESV)
</p>

<p>
<b>Revelation of John 20:4</b> - Then I saw thrones, and seated on them were those to whom the authority to judge was committed. Also I saw the souls of those who had been beheaded for the testimony of Jesus and for the word of God, and who had not worshiped the beast or its image and had not received its mark on their foreheads or their hands. They came to life and reigned with Christ for a thousand years.
</p>
</div>
</div>

<div id="outline-container-orgbd73fce" class="outline-3">
<h3 id="orgbd73fce"><span class="section-number-3">6.23.</span> There is no sexual immorality in Heaven, no violence, no sinners.</h3>
<div class="outline-text-3" id="text-6-23">
<p>
Heaven is not Earth. It's a place without sinning.
</p>

<p>
But the Kingdom of God exists from Heaven to Earth.
</p>

<p>
<b>Revelation 21:22-27</b> - And I saw no temple in the city, for its temple is the Lord God the Almighty and the Lamb. And the city has no need of sun or moon to shine on it, for the glory of God gives it light, and its lamp is the Lamb. By its light will the nations walk, and the kings of the earth will bring their glory into it, and its gates will never be shut by day—and there will be no night there. They will bring into it the glory and the honor of the nations. But nothing unclean will ever enter it, nor anyone who does what is detestable or false, but only those who are written in the Lamb's book of life. (ESV)
</p>

<p>
<b>Isaiah 11:6</b> - The wolf shall dwell with the lamb, and the leopard shall lie down with the young goat, and the calf and the lion and the fattened calf together; and a little child shall lead them. (ESV)
</p>

<p>
<b>Matthew 22:30</b> - For in the resurrection they neither marry nor are given in marriage, but are like angels in heaven.
</p>
</div>
</div>

<div id="outline-container-org62f8a91" class="outline-3">
<h3 id="org62f8a91"><span class="section-number-3">6.24.</span> Adhering to the law like a Pharisee - pursuing the law by works</h3>
<div class="outline-text-3" id="text-6-24">
<p>
But adhering to the law like a Pharisee is like strapping yourself to a razor blade, but that doesn't mean the law is wrong.
</p>

<p>
<b>Romans 3:20</b> - For by works of the law no human being will be justified in his sight, since through the law comes knowledge of sin.
</p>
</div>
</div>
