docs/faith-and-judgement.html

<div id="outline-container-org94bd278" class="outline-3">
<h3 id="org94bd278"><span class="section-number-3">6.25.</span> Follow the law mercifully and without self-righteousness, accountable to God, being a servant to others</h3>
<div class="outline-text-3" id="text-6-25">
<p>
So as to not become a hypocrite or condemn the innocent.
Accountable to God - a relationship with God.
Without self-righteousness.
</p>

<p>
<b>Acts 23:3</b> - Then Paul said to him, God is going to strike you, you whitewashed wall! Are you sitting to judge me according to the law, and yet contrary to the law you order me to be struck?
</p>

<p>
<b>Matthew 12:3-8</b> - He said to them, Have you not read what David did when he was hungry, and those who were with him: how he entered the house of God and ate the bread of the Presence, which it was not lawful for him to eat nor for those who were with him, but only for the priests?  Or have you not read in the Law how on the Sabbath the priests in the temple profane the Sabbath and are guiltless?  I tell you, something greater than the temple is here.  And if you had known what this means, I desire mercy, and not sacrifice, you would not have condemned the guiltless.  For the Son of Man is lord of the Sabbath.
</p>

<p>
The greatest among you will be your servant.
Keeping the commandments by faith results in a person a who is a servant, serving others.
</p>

<p>
<b>Luke 22:26</b> - But it is not this way with you, but the one who is the greatest among you must become like the youngest, and the leader like the servant.
</p>

<p>
<b>Matthew 5:19</b> - Therefore whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever does them and teaches them will be called great in the kingdom of heaven.
</p>

<p>
Not the best example, but, for example, when someone says you owe them money, and you can see they are blind, it's paying them because you're the one submitting to God.
It's humbling yourself even to others and following God's commandments in truth and reality, with a real faith relationship with God.
It's serving others as Jesus has served us.
It's keeping accountable to God and maintaining faithfulness to God, not keeping others accountable to you.
</p>

<p>
This isn't self-righteousness, but is a self-sacrificial obedience to continue working as a bond-servant of Christ, being the light of the world.
</p>
</div>
</div>

<div id="outline-container-orgc1c5f58" class="outline-3">
<h3 id="orgc1c5f58"><span class="section-number-3">6.26.</span> All the law is still used</h3>
<div class="outline-text-3" id="text-6-26">
<p>
The law is good and it still exists, and God still uses the law. All of it. We are supposed to stand for truth and live righteously as the light of the world.
</p>

<p>
That being said, we all fall short of the glory of God and require the God's righteousness imputed to us through faith in Jesus.
Jesus Christ is the end of the law to all who believe, but grace isn't an excuse to sin.
God's commandments (especially the 10 Commandments; loving God and your neighbour) are still binding on us - written on our heart when we get born-again.
</p>
</div>

<div id="outline-container-org12cfd94" class="outline-4">
<h4 id="org12cfd94"><span class="section-number-4">6.26.1.</span> Even the smallest of laws still come into effect in certain circumstances</h4>
<div class="outline-text-4" id="text-6-26-1">
<p>
<b>Leviticus 19:27</b> - You shall not round off the hair on your temples or mar the edges of your beard. (ESV)
</p>

<p>
For example, if Jesus sends you as an ambassador to some pagans and they asked you to shave your head in this specific way, or eat food sacrificed to idols.
</p>
</div>
</div>
</div>
