docs/faith-and-judgement.tex

\subsection{Follow the law mercifully and without self-righteousness, accountable to God, being a servant to others}
\label{sec:orgcd9b425}
So as to not become a hypocrite or condemn the innocent.
Accountable to God - a relationship with God.
Without self-righteousness.

\textbf{Acts 23:3} - Then Paul said to him, God is going to strike you, you whitewashed wall! Are you sitting to judge me according to the law, and yet contrary to the law you order me to be struck?

\textbf{Matthew 12:3-8} - He said to them, Have you not read what David did when he was hungry, and those who were with him: how he entered the house of God and ate the bread of the Presence, which it was not lawful for him to eat nor for those who were with him, but only for the priests?  Or have you not read in the Law how on the Sabbath the priests in the temple profane the Sabbath and are guiltless?  I tell you, something greater than the temple is here.  And if you had known what this means, I desire mercy, and not sacrifice, you would not have condemned the guiltless.  For the Son of Man is lord of the Sabbath.

The greatest among you will be your servant.
Keeping the commandments by faith results in a person a who is a servant, serving others.

\textbf{Luke 22:26} - But it is not this way with you, but the one who is the greatest among you must become like the youngest, and the leader like the servant.

\textbf{Matthew 5:19} - Therefore whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever does them and teaches them will be called great in the kingdom of heaven.

Not the best example, but, for example, when someone says you owe them money, and you can see they are blind, it's paying them because you're the one submitting to God.
It's humbling yourself even to others and following God's commandments in truth and reality, with a real faith relationship with God.
It's serving others as Jesus has served us.
It's keeping accountable to God and maintaining faithfulness to God, not keeping others accountable to you.

This isn't self-righteousness, but is a self-sacrificial obedience to continue working as a bond-servant of Christ, being the light of the world.

\subsection{All the law is still used}
\label{sec:orgd514468}
The law is good and it still exists, and God still uses the law. All of it. We are supposed to stand for truth and live righteously as the light of the world.

That being said, we all fall short of the glory of God and require the God's righteousness imputed to us through faith in Jesus.
Jesus Christ is the end of the law to all who believe, but grace isn't an excuse to sin.
God's commandments (especially the 10 Commandments; loving God and your neighbour) are still binding on us - written on our heart when we get born-again.

\subsubsection{Even the smallest of laws still come into effect in certain circumstances}
\label{sec:orgca68aea}

\textbf{Leviticus 19:27} - You shall not round off the hair on your temples or mar the edges of your beard. (ESV)

For example, if Jesus sends you as an ambassador to some pagans and they asked you to shave your head in this specific way, or eat food sacrificed to idols.
