docs/faith-and-judgement.html

<div id="outline-container-orgbe3b20f" class="outline-3">
<h3 id="orgbe3b20f"><span class="section-number-3">6.27.</span> Justification by faith - Jews + Gentiles, and in-between</h3>
<div class="outline-text-3" id="text-6-27">
<p>
Justification by faith is the correct teaching but the promise is for the gentiles AND the adherent of the law but they all must have faith, and pursuing the law as if by works is the problem, but pursuing the law by faith is ok.
</p>

<p>
I believe in-between is OK, so long as it is by faith.
</p>

<p>
<b>Romans 7:22</b> - For I delight in the law of God, in my inner being, (ESV)
</p>

<p>
<b>Romans 9:30-32</b> - What shall we say, then? That Gentiles who did not pursue righteousness have attained it, that is, a righteousness that is by faith; but that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone, (ESV)
</p>

<p>
<b>Romans 4:15-16</b> - For the law brings wrath, but where there is no law there is no transgression. That is why it depends on faith, in order that the promise may rest on grace and be guaranteed to all his offspring—not only to the adherent of the law but also to the one who shares the faith of Abraham, who is the father of us all, (ESV)
</p>

<p>
<b>Matthew 5:17-25</b> - Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. For truly, I say to you, until heaven and earth pass away, not an iota, not a dot, will pass from the Law until all is accomplished. Therefore whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever does them and teaches them will be called great in the kingdom of heaven. For I tell you, unless your righteousness exceeds that of the scribes and Pharisees, you will never enter the kingdom of heaven. You have heard that it was said to those of old, You shall not murder; and whoever murders will be liable to judgment. But I say to you that everyone who is angry with his brother will be liable to judgment; whoever insults his brother will be liable to the council; and whoever says, You fool! will be liable to the hell of fire. So if you are offering your gift at the altar and there remember that your brother has something against you, leave your gift there before the altar and go. First be reconciled to your brother, and then come and offer your gift. Come to terms quickly with your accuser while you are going with him to court, lest your accuser hand you over to the judge, and the judge to the guard, and you be put in prison. (ESV)
</p>
</div>
</div>

<div id="outline-container-orgc96473f" class="outline-3">
<h3 id="orgc96473f"><span class="section-number-3">6.28.</span> Theoretically belief usually comes before or at the time receiving the Holy Spirit</h3>
<div class="outline-text-3" id="text-6-28">
<p>
But for me I believe before I was born-again and before I was baptised in the Holy Spirit.
</p>

<p>
<b>Acts 19:1-7</b> - And it happened that while Apollos was at Corinth, Paul passed through the inland country and came to Ephesus.  There he found some disciples.  And he said to them, Did you receive the Holy Spirit when you believed?  And they said, No, we have not even heard that there is a Holy Spirit.  And he said, Into what then were you baptized?  They said, Into John's baptism.  And Paul said, John baptized with the baptism of repentance, telling the people to believe in the one who was to come after him, that is, Jesus. On hearing this, they were baptized in the name of the Lord Jesus. And when Paul had laid his hands on them, the Holy Spirit came on them, and they began speaking in tongues and prophesying. There were about twelve men in all.  (ESV)
</p>
</div>
</div>
</div>

<div id="outline-container-org7fc86ab" class="outline-2">
<h2 id="org7fc86ab"><span class="section-number-2">7.</span> Receive through the hearing of the word and faith</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>Galatians 3:2</b> - Let me ask you only this: Did you receive the Spirit by works of the law or by hearing with faith? (ESV)
</p>

<p>
Not just by hearing but by hearing with faith.
</p>
</div>

<div id="outline-container-orga257dc6" class="outline-3">
<h3 id="orga257dc6"><span class="section-number-3">7.1.</span> The promised Spirit is received through faith</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<b>Galatians 3:14</b> - so that in Christ Jesus the blessing of Abraham might come to the Gentiles, so that we might receive the promised Spirit through faith.  (ESV)
</p>
</div>

<div id="outline-container-orgcacbc98" class="outline-4">
<h4 id="orgcacbc98"><span class="section-number-4">7.1.1.</span> 2 years before being born again of the Spirit - prayer - proving belief came before being born-again</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
<a href="https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/prayer/">https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/prayer/</a>
</p>

<p>
Not that I have to prove it though!
</p>
</div>
</div>
