docs/faith-and-judgement.html

<div id="outline-container-orgab89185" class="outline-4">
<h4 id="orgab89185"><span class="section-number-4">7.1.2.</span> Over easter</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
<b>Ezekiel 11:19-20</b> - And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh, that they may walk in my statutes and keep my rules and obey them. And they shall be my people, and I will be their God. (ESV)
</p>

<p>
<b>Hebrews 8:10-13</b> - For this is the covenant that I will make with the house of Israel after those days, declares the Lord: I will put my laws into their minds, and write them on their hearts, and I will be their God, and they shall be my people.  And they shall not teach, each one his neighbor and each one his brother, saying, Know the Lord, for they shall all know me, from the least of them to the greatest.  For I will be merciful toward their iniquities, and I will remember their sins no more.  In speaking of a new covenant, he makes the first one obsolete. And what is becoming obsolete and growing old is ready to vanish away.
</p>

<p>
The old covenant is growing old and ready to vanish, but the New Covenant still involves the commandments but they are written on our heart.
We follow them in faith.
</p>
</div>

<ol class="org-ol">
<li><a id="orgfe72a3e"></a>Being born-again<br />
<div class="outline-text-5" id="text-7-1-2-1">
<p>
<a href="https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection/">https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection/</a>
</p>
</div>
</li>

<li><a id="org3ae7dd1"></a>Meeting with the Holy Spirit<br />
<div class="outline-text-5" id="text-7-1-2-2">
<p>
<a href="https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection-pt-2/">https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection-pt-2/</a>
</p>
</div>
</li>

<li><a id="orgbad5cab"></a>I wrote about following the law by faith, also law written on my heart.<br />
<div class="outline-text-5" id="text-7-1-2-3">
<p>
<a href="https://web.archive.org/web/20220703044748/https://mullikine.github.io/posts/the-tapestry-of-truth/">https://web.archive.org/web/20220703044748/https://mullikine.github.io/posts/the-tapestry-of-truth/</a>
</p>
</div>
</li>

<li><a id="orgc8e2bfe"></a>Baptised in the Holy Spirit<br />
<div class="outline-text-5" id="text-7-1-2-4">
<p>
<a href="https://web.archive.org/web/20220806085237/https://mullikine.github.io/posts/astral-projection-pt-3/">https://web.archive.org/web/20220806085237/https://mullikine.github.io/posts/astral-projection-pt-3/</a>
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgcf970a0" class="outline-3">
<h3 id="orgcf970a0"><span class="section-number-3">7.2.</span> Later in the year</h3>
<div class="outline-text-3" id="text-7-2">
<p>
<a href="https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/dream-the-way-the-truth-the-life/">https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/dream-the-way-the-truth-the-life/</a>
</p>
</div>
</div>

<div id="outline-container-orgd68f50c" class="outline-3">
<h3 id="orgd68f50c"><span class="section-number-3">7.3.</span> New covenant</h3>
<div class="outline-text-3" id="text-7-3">
<p>
<b>Hebrews 8:10-13</b> - For this is the covenant that I will make with the house of Israel after those days, declares the Lord: I will put my laws into their minds, and write them on their hearts, and I will be their God, and they shall be my people.  And they shall not teach, each one his neighbor and each one his brother, saying, Know the Lord, for they shall all know me, from the least of them to the greatest.  For I will be merciful toward their iniquities, and I will remember their sins no more.  In speaking of a new covenant, he makes the first one obsolete. And what is becoming obsolete and growing old is ready to vanish away.
</p>
</div>

<div id="outline-container-org90dbf5b" class="outline-4">
<h4 id="org90dbf5b"><span class="section-number-4">7.3.1.</span> Born of God</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
When a person is born-again of the Spirit, they receive the Spirit which helps them to stop sinning. It's really important to stop sinning.
</p>

<p>
<b>1 John 5:18</b> -  We know that everyone who has been born of God does not keep on sinning, but he who was born of God protects him, and the evil one does not touch him.  (ESV)
</p>

<p>
<b>Ezekiel 11:19-20</b> - And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh, that they may walk in my statutes and keep my rules and obey them. And they shall be my people, and I will be their God. (ESV)
</p>

<p>
<b>I John 3:9</b> - No one born of God makes a practice of sinning, for God's seed abides in him, and he cannot keep on sinning because he has been born of God.
</p>

<p>
But I would much like my dream life to be like the following:
</p>

<p>
<b>John 5:19</b> - So Jesus said to them, Truly, truly, I say to you, the Son can do nothing of his own accord, but only what he sees the Father doing. For whatever the Father does, that the Son does likewise.
</p>

<p>
Whoever loves in the way Jesus loved us and the way Jesus commanded us has been born of God and knows God.
</p>

<p>
<b>I John 4:7</b> - Beloved, let us love one another, for love is from God, and whoever loves has been born of God and knows God.
</p>

<p>
Anyone who <b>truly believes</b>.
</p>

<p>
<b>I John 5:1</b> - Everyone who believes that Jesus is the Christ has been born of God, and everyone who loves the Father loves whoever has been born of him.
</p>

<p>
<b>I John 5:4</b> - For everyone who has been born of God overcomes the world. And this is the victory that has overcome the world—our faith.
</p>

<p>
<b>I John 5:18</b> - We know that everyone who has been born of God does not keep on sinning, but he who was born of God protects him, and the evil one does not touch him.
</p>

<p>
I feel like stopping sin is very important after being born again.
</p>

<p>
<b>John 5:14</b> - Afterward Jesus found him in the temple and said to him, See, you are well! Sin no more, that nothing worse may happen to you.
</p>
</div>
</div>
</div>
