docs/faith-and-judgement.tex

\subsubsection{Over easter}
\label{sec:orgf488336}
\textbf{Ezekiel 11:19-20} - And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh, that they may walk in my statutes and keep my rules and obey them. And they shall be my people, and I will be their God. (ESV)

\textbf{Hebrews 8:10-13} - For this is the covenant that I will make with the house of Israel after those days, declares the Lord: I will put my laws into their minds, and write them on their hearts, and I will be their God, and they shall be my people.  And they shall not teach, each one his neighbor and each one his brother, saying, Know the Lord, for they shall all know me, from the least of them to the greatest.  For I will be merciful toward their iniquities, and I will remember their sins no more.  In speaking of a new covenant, he makes the first one obsolete. And what is becoming obsolete and growing old is ready to vanish away.

The old covenant is growing old and ready to vanish, but the New Covenant still involves the commandments but they are written on our heart.
We follow them in faith.

\begin{enumerate}
\item Being born-again
\label{sec:org7f8c007}
\url{https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection/}

\item Meeting with the Holy Spirit
\label{sec:orgc371469}
\url{https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/astral-projection-pt-2/}

\item I wrote about following the law by faith, also law written on my heart.
\label{sec:orge30be60}

\url{https://web.archive.org/web/20220703044748/https://mullikine.github.io/posts/the-tapestry-of-truth/}

\item Baptised in the Holy Spirit
\label{sec:org7a49b7d}
\url{https://web.archive.org/web/20220806085237/https://mullikine.github.io/posts/astral-projection-pt-3/}
\end{enumerate}

\subsection{Later in the year}
\label{sec:orga403308}
\url{https://web.archive.org/web/20220402091720/https://mullikine.github.io/posts/dream-the-way-the-truth-the-life/}

\subsection{New covenant}
\label{sec:orga23367e}
\textbf{Hebrews 8:10-13} - For this is the covenant that I will make with the house of Israel after those days, declares the Lord: I will put my laws into their minds, and write them on their hearts, and I will be their God, and they shall be my people.  And they shall not teach, each one his neighbor and each one his brother, saying, Know the Lord, for they shall all know me, from the least of them to the greatest.  For I will be merciful toward their iniquities, and I will remember their sins no more.  In speaking of a new covenant, he makes the first one obsolete. And what is becoming obsolete and growing old is ready to vanish away.

\subsubsection{Born of God}
\label{sec:org6b8825f}
When a person is born-again of the Spirit, they receive the Spirit which helps them to stop sinning. It's really important to stop sinning.

\textbf{1 John 5:18} -  We know that everyone who has been born of God does not keep on sinning, but he who was born of God protects him, and the evil one does not touch him.  (ESV)

\textbf{Ezekiel 11:19-20} - And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh, that they may walk in my statutes and keep my rules and obey them. And they shall be my people, and I will be their God. (ESV)

\textbf{I John 3:9} - No one born of God makes a practice of sinning, for God's seed abides in him, and he cannot keep on sinning because he has been born of God.

But I would much like my dream life to be like the following:

\textbf{John 5:19} - So Jesus said to them, Truly, truly, I say to you, the Son can do nothing of his own accord, but only what he sees the Father doing. For whatever the Father does, that the Son does likewise.

Whoever loves in the way Jesus loved us and the way Jesus commanded us has been born of God and knows God.

\textbf{I John 4:7} - Beloved, let us love one another, for love is from God, and whoever loves has been born of God and knows God.

Anyone who \textbf{truly believes}.

\textbf{I John 5:1} - Everyone who believes that Jesus is the Christ has been born of God, and everyone who loves the Father loves whoever has been born of him.

\textbf{I John 5:4} - For everyone who has been born of God overcomes the world. And this is the victory that has overcome the world—our faith.

\textbf{I John 5:18} - We know that everyone who has been born of God does not keep on sinning, but he who was born of God protects him, and the evil one does not touch him.

I feel like stopping sin is very important after being born again.

\textbf{John 5:14} - Afterward Jesus found him in the temple and said to him, See, you are well! Sin no more, that nothing worse may happen to you.
