docs/faith-and-judgement.tex

\subsection{Justification by faith for the both adherents of the law and the gentiles}
\label{sec:orgeb12fa2}
Justification by faith is the correct teaching but the promise is for the gentiles AND the adherent of the law but they all must have faith, and pursuing the law as if by works is the problem, but pursuing the law by faith is ok.

\textbf{Romans 7:22} - For I delight in the law of God, in my inner being, (ESV)

\textbf{Romans 9:30-32} - What shall we say, then? That Gentiles who did not pursue righteousness have attained it, that is, a righteousness that is by faith; but that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone, (ESV)

\textbf{Romans 4:15-16} - For the law brings wrath, but where there is no law there is no transgression. That is why it depends on faith, in order that the promise may rest on grace and be guaranteed to all his offspring—not only to the adherent of the law but also to the one who shares the faith of Abraham, who is the father of us all, (ESV)

\subsection{Paul used the law to judge back, but without hypocrisy}
\label{sec:orgea38616}
\textbf{Matthew 23:27} - Woe to you, scribes and Pharisees, hypocrites! For you are like whitewashed tombs, which outwardly appear beautiful, but within are full of dead people's bones and all uncleanness.

\textbf{Acts 23:3} - Then Paul said to him, God is going to strike you, you whitewashed wall! Are you sitting to judge me according to the law, and yet contrary to the law you order me to be struck?

\subsection{Justified by God through faith and works}
\label{sec:orge6585cf}
Predestined, called, justified, glorified - sounds like election.
\subsubsection{God is the one who justifies}
\label{sec:org9c50435}

Romans 8:33: Who shall bring any charge against God's elect? It is God who justifies.

\textbf{Romans 8:30} - And those whom he predestined he also called, and those whom he called he also justified, and those whom he justified he also glorified. (ESV)

But repentance is a work of the heart which is an act of faith.
I believe repentance is inseparable from faith because intrinsic to faith is belief and intrinsic to belief is metanoia (changing one's mind).

At it's most basic form repentance means a person believes in Jesus as the Son of God and the Messiah who, being innocent, paid the price for their sin through His broken body and shed blood on the cross - a perfect and eternal offering; that He died there but God resurrected Him, and He is Lord of Heaven and Earth.

But I believe we are forgiven to forgive others. That must be part of the act of faith and the change of heart, I think.

\textbf{Matthew 6:15} - but if you do not forgive others their trespasses, neither will your Father forgive your trespasses.  (ESV)
