docs/faith-and-judgement.tex

\subsubsection{Justified by faith alone. But faith is substantiated by works}
\label{sec:org2ed3052}
\textbf{James 2:10} - For whoever keeps the whole law but fails in one point has become accountable for all of it.  For he who said, Do not commit adultery, also said, Do not murder. If you do not commit adultery but do murder, you have become a transgressor of the law.  So speak and so act as those who are to be judged under the law of liberty.  For judgment is without mercy to one who has shown no mercy. Mercy triumphs over judgment.  What good is it, my brothers, if someone says he has faith but does not have works? Can that faith save him?  If a brother or sister is poorly clothed and lacking in daily food, and one of you says to them, Go in peace, be warmed and filled, without giving them the things needed for the body, what good is that?  So also faith by itself, if it does not have works, is dead.  But someone will say, You have faith and I have works. Show me your faith apart from your works, and I will show you my faith by my works.  You believe that God is one; you do well. Even the demons believe—and shudder!  Do you want to be shown, you foolish person, that faith apart from works is useless?  Was not Abraham our father justified by works when he offered up his son Isaac on the altar?  You see that faith was active along with his works, and faith was completed by his works; and the Scripture was fulfilled that says, Abraham believed God, and it was counted to him as righteousness—and he was called a friend of God.  You see that a person is justified by works and not by faith alone.

I tend to agree with James on this.
Eliminating works from faith is not good.

Works:
\begin{itemize}
\item obedience
\item faithfulness
\begin{itemize}
\item keeping God's commandments
\end{itemize}
\item trust
\item fear of God
\item response of love
\begin{itemize}
\item thankfulness
\item praise
\item forgiving others
\end{itemize}
\item humility
\begin{itemize}
\item keeping God's commandments
\end{itemize}
\item patient endurance (time)
\end{itemize}

If a person believes that Jesus Christ is the Son of the Living God then they abide in Christ.
But do they \textbf{really} believe? Because if they don't \textbf{really} believe it deep down then but are lying to themself they may not abide in Christ at all.
How can a person believe without having a relationship with God? A relationship involves more than belief.

If a person does not have obedience, trust and
repentance from sin, but their faith has belief, then they only
abide in Jesus extremely precariously, and also that person's 'faith' probably wont receive much at all from God.

Faith = Belief * truth * obedience * faithfulness * fear-of-God * response-of-love * patient-endurance(time)

These things are factors of faith.
God is the judge.

A person must/should \textbf{do} what Jesus said.

\textbf{Luke 6:47-49} - Everyone who comes to me and hears my words and does them, I will show you what he is like: he is like a man building a house, who dug deep and laid the foundation on the rock. And when a flood arose, the stream broke against that house and could not shake it, because it had been well built.  But the one who hears and does not do them is like a man who built a house on the ground without a foundation. When the stream broke against it, immediately it fell, and the ruin of that house was great.

\textbf{Matthew 7:24-27} - Everyone then who hears these words of mine and does them will be like a wise man who built his house on the rock. And the rain fell, and the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on the rock. And everyone who hears these words of mine and does not do them will be like a foolish man who built his house on the sand. And the rain fell, and the floods came, and the winds blew and beat against that house, and it fell, and great was the fall of it. (ESV)

\subsubsection{Paul here mentions trust even for the one who justifies the ungodly}
\label{sec:org984f627}
\textbf{Romans 4:5} - And to the one who does not work but trusts him who justifies the ungodly, his faith is counted as righteousness,

\subsection{Then, glorification}
\label{sec:org82a6d32}
Glorification is the good works including forgiving others.

Forgiving others, walking righteously, and doing good works glorifies Jesus and glorifies God.

\subsubsection{Forgive others' offenses towards you}
\label{sec:orgfb0bad2}
\textbf{Proverbs 19:11} - Good sense makes one slow to anger, and it is his glory to overlook an offense. (ESV)

\textbf{Ephesians 4:32} - Be kind to one another, tenderhearted, forgiving one another, as God in Christ forgave you. (ESV)

\subsubsection{Be extremely generous}
\label{sec:orgd921ce0}
\textbf{Matthew 10:8} - Heal the sick, raise the dead, cleanse lepers, cast out demons. You received without paying; give without pay. (ESV)
