docs/faith-and-judgement.html

<div id="outline-container-org0a93329" class="outline-4">
<h4 id="org0a93329"><span class="section-number-4">7.7.3.</span> Do the good works which have been gifted to you</h4>
<div class="outline-text-4" id="text-7-7-3">
<p>
<b>Ephesians 2:10</b> - For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand, that we should walk in them.  (ESV)
</p>

<p>
<b>Matthew 5:16</b> - In the same way, let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven.  (ESV)
</p>
</div>
</div>

<div id="outline-container-orgdc7d453" class="outline-4">
<h4 id="orgdc7d453"><span class="section-number-4">7.7.4.</span> Walk in righteousness</h4>
<div class="outline-text-4" id="text-7-7-4">
<p>
<b>Daniel 12:3</b> -  And those who are wise shall shine like the brightness of the sky above; and those who turn many to righteousness, like the stars forever and ever.  (ESV)
</p>
</div>
</div>

<div id="outline-container-org5d9df44" class="outline-4">
<h4 id="org5d9df44"><span class="section-number-4">7.7.5.</span> I think to relax commandments is throw away glorification</h4>
<div class="outline-text-4" id="text-7-7-5">
<p>
<b>Matthew 5:19</b> -  Therefore whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever does them and teaches them will be called great in the kingdom of heaven.  (ESV)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0781c9d" class="outline-2">
<h2 id="org0781c9d"><span class="section-number-2">8.</span> Jesus Christ is Lord! :)</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2024-02-07 Wed 13:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>