docs/faith-and-judgement.tex

\subsubsection{Do the good works which have been gifted to you}
\label{sec:org4c2c25b}
\textbf{Ephesians 2:10} - For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand, that we should walk in them.  (ESV)

\textbf{Matthew 5:16} - In the same way, let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven.  (ESV)

\subsubsection{Walk in righteousness}
\label{sec:org2155072}

\textbf{Daniel 12:3} -  And those who are wise shall shine like the brightness of the sky above; and those who turn many to righteousness, like the stars forever and ever.  (ESV)

\subsubsection{I think to relax commandments is throw away glorification}
\label{sec:org43a73e5}
\textbf{Matthew 5:19} -  Therefore whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever does them and teaches them will be called great in the kingdom of heaven.  (ESV)

\section{Jesus Christ is Lord! :)}
\label{sec:org1ff3c7f}
\end{document}